{"de":[{"title":"Camunda 7.3 wurde am 31. Mai veröffentlicht","text":"Berlin – Der Software-Hersteller Camunda hat am 31. Mai die neue Version 7.3 der gleichnamigen Open-Source-Software zur Prozessautomatisierung veröffentlicht. Das Produkt kann unter www.camunda.org kostenlos herunter geladen werden.\n\nDie neue Version ermöglicht die Statusänderung laufender Vorgänge, so dass Prozessinstanzen „on-the-fly“ in einen anderen Zustand überführt werden können. Damit verbunden ist eine flexible Möglichkeit zur Vergabe von Autorisierungen, so dass beispielsweise die Angehörigen bestimmter Benutzergruppen nur bestimmte Geschäftsprozesse sehen, starten oder verändern können. Die dritte große Neuerung ist die Plugin-Architektur der mitgelieferten Aufgabenliste „Tasklist“, mit der die Mitarbeiter einer Organisation die ihnen zugewiesenen Aufgaben erledigen können. Die neue Architektur erlaubt es, die Funktionen der Aufgabenliste flexibel anzupassen und zu erweitern.\n\nLaut Herstellerangaben wurde die neue Version besonders durch Kundenwünsche, beispielsweise von T-Mobile Austria, beeinflusst, da Camunda mittlerweile in zahlreichen Großunternehmen für geschäftskritische Kernprozesse eingesetzt wird. \n\nÜber Camunda Services GmbH:\n\nDie Camunda Services GmbH mit Sitz in Berlin ist ein Software- und Beratungshaus, das sich auf Business Process Management (BPM) spezialisiert hat. Das Kernprodukt der Firma, Camunda BPM, ist eine Open Source Plattform für die Automatisierung von Geschäftsprozessen.  Zu den Kunden von Camunda zählen die Generali Versicherungen, Lufthansa Technik und Zalando.\n\nPressekontakt:\n\nFür weitergehende Informationen steht zu Ihrer Verfügung:\nNastasja Johnston\nTel.: 030 664 04 09 00\nEmail: Nastasja.Johnston@camunda.com \n","date":"2015-06-01","technicalName":"camunda-7-3-was-released-on-may-31st"},{"title":"Michael Ferber übernimmt Bereichsleitung bei Camunda","text":"Berlin – Zum 02.10. hat Michael Ferber die Leitung des Consulting-Bereiches bei der auf Business Process Management (BPM) spezialisierten Camunda Services GmbH übernommen. Herr Ferber wechselt nach einer langjährigen Karriere bei der Bosch Software Innovations GmbH, die im Jahr 2011 unter Anderem den BPM Softwarehersteller inubit AG übernommen hatte. Bei Bosch SI führte Herr Ferber als Senior Manager unterschiedliche  Entwickler- und Beraterteams, zuletzt im Bereich Industry & Logistics.\n\n„Die Entscheidung für ein vergleichsweise junges und kleines Unternehmen trifft man nicht über Nacht“, kommentiert Herr Ferber den Wechsel. Die überzeugende Vision allein hätte hier nicht ausgereicht. „Ausschlaggebend waren für mich am Ende auch die nachweisbaren Erfolge und die klar erkennbare Strategie von Camunda.“\n\nCamunda-Geschäftsführer Jakob Freund ergänzt: „Wir freuen uns sehr, mit Michael Ferber eine erfahrene und erfolgreiche Führungspersönlichkeit zu gewinnen, die unser ambitioniertes Wachstum mit vorantreiben wird.“\n\nÜber Camunda Services GmbH:\n\nDie Camunda Services GmbH mit Sitz in Berlin ist ein Software- und Beratungshaus, das sich auf Business Process Management (BPM) spezialisiert hat. Das Kernprodukt der Firma, Camunda BPM, ist eine Open Source Plattform für die Automatisierung von Geschäftsprozessen. Camunda BPM kombiniert die drei Standard BPMN, CMMN und DMN zur Ausführung strukturierter Abläufe, unstrukturierter Cases und Entscheidungstabellen.  Zu den Kunden von Camunda zählen Allianz, T-Mobile und Zalando.\n\nPressekontakt:\n\nFür weitergehende Informationen steht zu Ihrer Verfügung:\nNastasja Johnston\nTel.: 030 664 04 09 00\nEmail: Nastasja.Johnston@camunda.com \n","date":"2015-10-02","technicalName":"michael-ferber-ubernimmt-bereichsleitung-bei-camunda"},{"title":"Camunda BPM 7.4 wurde am 30. November veröffentlicht","text":"__Berlin__ – Der Software-Hersteller Camunda hat am 30. November die neue Version 7.4 der gleichnamigen Open-Source-Software für Business Process Management (BPM) veröffentlicht. Das Produkt kann unter www.camunda.org kostenlos herunter geladen werden. \n\nCamunda BPM 7.4 unterstützt den Standard „Decision Model and Notation (DMN)“, der Mitte 2015 von der Object Management Group (OMG) veröffentlicht wurde – derselben Institution, die auch für den etablierten BPMN-Standard verantwortlich ist. Mit DMN können Entscheidungstabellen definiert und technisch automatisiert werden. Auf diese Weise erhalten Fachanwender die Möglichkeit, ihre Geschäftsregeln selbständig zu verwalten und bei Bedarf kurzfristig anzupassen.  \n\nCamunda BPM 7.4 enthält einen DMN-konformen Tabelleneditor, eine technische Engine zur Ausführung von DMN-Tabellen und eine Web-Anwendung, die eine Nachvollziehbarkeit der automatisiert getroffenen Entscheidungen ermöglicht, sowie eine Änderung der Tabellen während des Betriebs erlaubt. Aufgrund der Kombinierbarkeit von DMN mit den ebenfalls in Camunda umgesetzten Standards BPMN (Workflow-Automatisierung) und CMMN (Case Management) verspricht der Hersteller eine ganzheitlichere Abbildung von Geschäftsprozessen. \nEbenfalls neu – und open source – ist der Camunda Modeler zur Modellierung von BPMN-Prozessdiagrammen. Das Werkzeug basiert auf dem bekannten Projekt bpmn.io und soll laut Herstellerangabe eine besonders komfortable Bedienung erlauben, um sowohl Fachanwender als auch Entwickler zu begeistern.\n\nDer Geschäftsführer Jakob Freund kommentiert: „Wieder einmal treibt Camunda die Innovation im Markt für BPM. Unser Kernprodukt stellen wir open source zu Verfügung, gleichzeitig sind wir ein profitables Unternehmen mit 40 Mitarbeitern, ohne jegliche externe Finanzierung. Zu unseren Kunden zählen AT&T, Allianz Indonesia, die Deutsche Bahn und Zalando. Neben SAP und der Software AG sind wir das einzige Unternehmen aus Deutschland, das im aktuellen Report ‚Vendor Landscape BPM Platforms for Digital Business‘ [1] der Forrester Group behandelt wird. Ich denke, wir können stolz auf das Erreichte sein.“\n\n[1] https://www.forrester.com/Vendor+Landscape+BPM+Platforms+For+Digital+Business/fulltext/-/E-res128401\n\nÜber Camunda Services GmbH:\n\nDie Camunda Services GmbH mit Sitz in Berlin ist ein Software- und Beratungshaus, das sich auf Business Process Management (BPM) spezialisiert hat. Das Kernprodukt der Firma, Camunda BPM, ist eine Open Source Plattform für die Automatisierung von Geschäftsprozessen. \n\nPressekontakt:\n\nFür weitergehende Informationen steht zu Ihrer Verfügung:\nNastasja Johnston\nTel.: 030 664 04 09 00\nEmail: Nastasja.Johnston@camunda.com \n","date":"2015-11-30","technicalName":"camunda-bpm-7-4-has-been-released-on-november-30th"},{"title":"Camunda startet Beta-Test für DMN in der Cloud","text":"Der Softwarehersteller Camunda hat heute den offenen Beta-Test für einen Cloud-Dienst aufgenommen, mit dem sich DMN-Entscheidungstabellen erstellen und automatisieren lassen. Er ist ab sofort unter https://dmn.camunda.cloud kostenlos nutzbar.\n\nDMN (\"Decision Model and Notation\") ist ein IT-Industriestandard für das Management von Entscheidungen. Mit DMN können Fachanwender in die technische Umsetzung von Geschäftsregeln deutlich effektiver einbezogen werden, und diese auch außerhalb relativ starrer Entwicklungszyklen kurzfristig anpassen.\n\nMit ihrem Cloud-Dienst will Camunda jedem Entwickler die Möglichkeit geben, DMN in eigenen Anwendungen zu nutzen, ohne die erforderliche DMN-Engine selbst einbauen oder betreiben zu müssen. DMN-Tabellen können direkt im Web-Browser entwickelt und getestet werden. Nach dem one-click-deployment stehen sie über eine REST API zur Verfügung und können somit aus jeder Anwendung heraus aufgerufen und ausgeführt werden. Das Ergebnis wird dann zwecks weiterer Verarbeitung an die Anwendung zurück gemeldet. Auf der Webseite des Dienstes stehen Code-Beispiele für diverse Programmiersprachen wie Java, Javascript, C# oder PHP bereit.\n\n\"Wir haben unseren DMN-Dienst bewusst so einfach wie möglich gehalten\", erklärt Jakob Freund, Geschäftsführer bei Camunda. \"Wir möchten, dass jeder Softwareentwickler mit minimalem Aufwand von DMN profitieren kann.\"\n\nIm aktuellen Beta-Test ist der neue Dienst kostenlos nutzbar. Allerdings gibt Camunda auch keine Zusicherungen in Bezug auf Verfügbarkeit, Fehlerfreiheit und Datenschutz. Ein Termin für den Abschluss des Beta-Tests ist bislang nicht bekannt, wie Jakob Freund betont: \"Wir möchten zunächst einmal lernen, wie ein solches Angebot in der Entwicklergemeinde angenommen und genutzt wird. Das wird uns helfen, die nächsten Schritte in Richtung 'Camunda in der Cloud' zu machen.\"\n\nÜber Camunda Services GmbH:\nDie Camunda Services GmbH mit Sitz in Berlin ist ein Software- und Beratungshaus, das sich auf Business Process Management (BPM) spezialisiert hat. Das Kernprodukt der Firma, Camunda BPM, ist eine Open Source Plattform für die Automatisierung von Geschäftsprozessen.  Sie wird genutzt von Firmen wie AT&T, Deutsche Bahn und Zalando.\n","date":"2016-03-21","technicalName":"camunda-starts-beta-test-for-dmn-in-the-cloud"},{"title":"Berliner Softwarehersteller für innovativste Lösung zu Business Process Management (BPM) ausgezeichnet","text":"Santa Barbara,CA | 24. April - Der Berliner Softwarehersteller Camunda hat zum zweiten Mal in Folge den Award \"Best in Show\" der bpmNEXT gewonnen. Die alljährlich im kalifornischen Santa Barbara stattfindende Veranstaltung ist die weltweit wichtigste Konferenz für BPM-Softwarehersteller, die dort ihre neuesten Innovationen vorstellen.\n\nCamunda wurde für seine komplett neue Technologie zur Workflow-Automatisierung ausgezeichnet. Die Teilnehmer überzeugte bei der Vorführung vor allem der um den Faktor 200 gesteigerte Durchsatz bei der Ausführung von Workflows.\n \n\"Die fortschreitende Digitalisierung führt zu einer massiven Zunahme komplexer technischer Transaktionen\", erklärt Jakob Freund, CEO von Camunda, die Motivation hinter diesem Projekt. \"Klassische Workflow-Technologien besitzen jedoch eine limitierte Performance und Skalierbarkeit. Hinzu kommen neue Paradigmen wie Microservices und NoSQL-Datenbanken, die sich mit klassischer Workflow-Technologie schlecht abbilden lassen. Mit unserer neuen Technologie adressieren wir dieses Problem.\"\n \nDass Camunda den begehrten Publikums-Award der bpmNEXT erhalten hat, versteht Jakob Freund als Bestätigung: \"In Santa Barbara haben wir gesehen, dass die BPM-Branche sowohl die Relevanz des Problems als auch unseren Lösungsansatz anerkannt hat. Natürlich sind wir auch stolz, den Award als bislang einziger Hersteller schon zum zweiten Mal erhalten zu haben.\"\n \nCamunda verprobt seine neue Technologie laut eigener Angabe derzeit mit ersten Kunden im Betamodus. Eine allgemeine Veröffentlichung als Open Source - Projekt wird in wenigen Monaten erwartet.\n\n\nÜber Camunda Services GmbH:\nCamunda ist ein Berliner Softwarehersteller, der sich auf das BPM (Business Process Management) spezialisiert hat. Das Kernprodukt der Firma, Camunda BPM, ist eine Open Source Plattform für die Automatisierung von Geschäftsprozessen. Zu den Kunden von Camunda zählen die Deutsche Bahn, Lufthansa Technik und Zalando. Das Umsatzwachstum des Unternehmens betrug 2016 rd. 82%. Derzeit beschäftigt Camunda rd. 70 Mitarbeiter am Hauptstandort Berlin sowie in seinen Niederlassungen in San Francisco und Denver, USA.\n\n\nFür weitergehende Informationen steht zu Ihrer Verfügung:\nDarya Niknamian, Content Marketing Manager\nEmail: Darya.Niknamian@camunda.com \n\nCamunda Services GmbH\nZossener Str. 55 – 10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nGeschäftsführer: Jakob Freund, Bernd Rücker\n","date":"2017-04-24","technicalName":"berlin-software-vendor-awarded-most-innovative-solution-for-business-process-management"},{"title":"Camunda bietet neue Lösung zur Prozessverbesserung","text":"Der Berliner Softwarehersteller Camunda hat ein neues Tool zur Prozessverbesserung veröffentlicht. \n\nCawemo (www.cawemo.com) ist ein SaaS-Produkt zur gemeinsamen Gestaltung von Prozessmodellen. Es unterstützt den ISO-Standard BPMN und legt den funktionalen Fokus auf eine extrem einfache Bedienbarkeit sowie bestmögliche Nutzung in Teams. \n\nJakob Freund, CEO von Camunda, kommentiert: \"Mit Tools wie Trello und Slack hat eine neue Ära von Enterprise-Apps begonnen. Wir läuten diese Ära nun auch für die Organisation von Geschäftsprozessen ein. Wer selbst Prozesse lebt, weiß am Besten, wie sie besser laufen könnten. Mit Cawemo bekommt nun jeder die Chance, die eigenen Prozesse zu verbessern. Das Zeitalter der zentralisierten Prozessorganisation gehört beendet.\"\n\nDiese Vision drückt sich auch im Preismodell von Cawemo aus: So sind Teams mit bis zu drei Nutzern kostenfrei. Ab dem vierten Nutzer wird eine im Vergleich zu ähnlichen Tools sehr geringe Gebühr von 12 US-Dollar pro Nutzer und Monat fällig. \n\n\"Mit diesem Preismodell können auch kleine Teams mit wenig bis gar keinem Budget ihre eigenen Prozesse designen, kommunizieren und optimieren\" erklärt Jakob Freund. Während vergleichbare Anbieter ihre Produkte eher über höhere Führungskräfte im Unternehmen platzieren, will Camunda jedem Sachbearbeiter oder Gruppenleiter erlauben, Cawemo direkt und ohne aufwendige Beschaffungsprozesse einzusetzen. \n\nAuf seiner Website wirbt Cawemo mit den folgenden Funktionen: \n\n•\tDesign von Prozessmodellen in der Cloud und somit von überall abrufbar, \n•\tKollaboration von Team-Mitgliedern in Echtzeit, also ein gleichzeitiges Bearbeiten und Kommentieren von Prozessmodellen, \n•\tOptimierung von Prozessen und Arbeitsabläufen im ganzen Unternehmen, indem die Modelle einfach geteilt und in Wissensmanagement-tools wie Confluence eingebunden werden können. Sobald eine Änderung am Prozessmodell in Cawemo vorgenommen wird, sind auch die geteilten Modelle auf dem aktuellsten Stand. \n\nÜber Camunda: \nCamunda ist ein Berliner Softwarehersteller, der sich auf das BPM (Business Process Management) spezialisiert hat. Das Kernprodukt der Firma, Camunda BPM, ist eine Open Source Plattform für die Automatisierung von Geschäftsprozessen. Zu den Kunden von Camunda zählen die Deutsche Bahn, Lufthansa Technik und Zalando. Das Umsatzwachstum des Unternehmens betrug 2016 rd. 82%. Derzeit beschäftigt Camunda rd. 70 Mitarbeiter am Hauptstandort Berlin sowie in seinen Niederlassungen in San Francisco und Denver, USA.\n\nÜber Trello:\nTrello ist eine web-basierte Projektmanagementsoftware, die vom australischen Unternehmen Atlassian betrieben wird. \n\nÜber Slack:\nSlack ist ein webbasierter Instant-Messaging-Dienst des US-amerikanischen Unternehmens Slack Technologies zur Kommunikation innerhalb von Arbeitsgruppen.\n\nÜber Confluence:\nConfluence ist eine kommerzielle Wiki-Software, die vom australischen Unternehmen Atlassian entwickelt wird.\n","date":"2017-05-02","technicalName":"camunda-offers-a-new-solution-for-process-improvement"},{"title":"Energy Giant chooses Camunda BPM to kindle Digital Transformation","text":"","date":"2017-05-30","technicalName":"energy-giant-chooses-camunda-bpm-to-kindle-digital-transformation"},{"title":"Camunda startet Zeebe, ein neues Open Source Projekt für Microservice-Orchestrations","text":"Berlin, Deutschland | 10. August 2017 - Der Berliner Softwarehersteller Camunda hat mit Zeebe eine neue Open-Source-Technologie zur Orchestrierung von Microservices veröffentlicht. Mit Zeebe können Orchestration Flows im ISO-Standard BPMN visuell definiert und technisch ausgeführt werden. Zeebe stellt hierbei die vollständige Ausführung der Flows sicher: Kommt es in einem Schritt zu einem Fehler, wird dieser Schritt wiederholt ausgeführt bis er erfolgreich abgeschlossen werden kann. Zeebe führt ein vollständiges Audit Log, so dass der Fortschritt auch visuell mit BPMN nachvollzogen und überwacht werden kann. Zeebe ist ein Big Data system und skaliert mit wachsenden Transaktionsvolumen.\n\nJakob Freund, CEO von Camunda, erklärt die Motivation hinter dem Projekt: \"Durch die digitale Transformation stehen Unternehmen zunehmend unter Innovationsdruck und müssen ihre IT-Entwicklungsprozesse skalieren. Um die dafür notwendige Agilität zu gewinnen, setzen immer mehr Unternehmen auf Microservices und brechen große monolithische Systeme in kleine Teile auf. Die dadurch entstehende Verteilung erschwert jedoch die zuverlässige Ausführung und Überwachung geschäftskritischer Transaktionen und Prozesse über mehrere verteilte Microservices hinweg. Wir haben Zeebe entwickelt um Unternehmen in die Lage zu versetzen die Vorteile von Microservices zu nutzen und gleichzeitig die Kontrolle über ihren Betrieb zu behalten.\"\n\nZeebe ist ein verteiltes System und setzt auf Event-Sourcing, Append-only Persistenz und Datenreplikation. \"Zeebe stellt für uns einen Meilenstein in der Entwicklung von Workflow Engines dar. Als wir das Projekt gestartet haben war uns klar dass wir eine komplett neue Basis schaffen müssen, um den extremen Anforderungen an Skalierung und Fehlertoleranz gerecht werden zu können\", sagt Daniel Meyer, VP Engineering.\n\nZeebe kann in Kombination mit verschiedenen Programmiersprachen verwendet werden. Clients für Java und Go werden aktuell entwickelt, weitere folgen später.\n\nEine produktionsreife Version von Zeebe ist für den Anfang des Jahres 2018 geplant. Weitere Informationen zu Zeebe finden Sie unter https://zeebe.io.\n \nÜber Camunda\nCamunda ist ein Berliner Softwarehersteller, der sich auf BPM (Business Process Management) spezialisiert hat. Zu den Kunden von Camunda zählen die Deutsche Bahn, Lufthansa Technik und Zalando. Das Umsatzwachstum des Unternehmens betrug 2016 rd. 82%. Derzeit beschäftigt Camunda rd. 70 Mitarbeiter am Hauptstandort Berlin sowie in seinen Niederlassungen in San Francisco und Denver, USA.\n\nFür weitergehende Informationen steht zu Ihrer Verfügung:\nDarya Niknamian, Content Marketing Manager\nE-mail: Darya.Niknamian@camunda.com","date":"2017-08-10","technicalName":"camunda-launches-zeebe-a-new-open-source-project-for-microservice-orchestration"},{"title":"Camunda kombiniert Big Data und Workflow Automation für sekundengenaues Monitoring von geschäftskritischen Kernprozessen","text":"Optimize 2.0 bietet kontinuierliche Transparenz für Geschäftsprozesse sowie Unterstützung bei der Erkennung und Beseitigung von Schwachstellen.\n\nBERLIN und SAN FRANCISCO, 5. April 2018  –  Camunda , der Softwarehersteller für Prozessautomatisierung, hat heute die Veröffentlichung von Camunda Optimize 2.0 bekannt gegeben, der ersten Softwarelösung zur Kombination von Big Data und Workflow Automation. Mit Optimize 2.0 erhalten Anwender einen ganzheitlichen Überblick über die Performance von Geschäftsprozessen, die in der Camunda BPMN Workflow Engine automatisiert ablaufen. Führungskräfte können Optimize 2.0 nutzen, um akute oder potentielle Schwachstellen in geschäftskritischen Kernprozessen zu erkennen und abzustellen.\n\nOptimize 2.0 ist Teil der Camunda Enterprise Platform und wird im Release Webinar am 12. April um 10 Uhr detailliert demonstriert:  https://attendee.gotowebinar.com/register/618380022669097217\n\nEine Testversion kann ab sofort auf der Website des Herstellers heruntergeladen werden: https://camunda.com/download/enterprise/\n\n“Mit zunehmender Automatisierung unserer Prozesse zeichnet sich ab, dass eine End-To-End-Sicht auf unsere Abläufe der Schlüssel ist, um unser Tagesgeschäft im Blick zu behalten und systematisch zu verbessern”, kommentiert Uwe Koch, IT Enterprise Architekt bei Talanx, dem drittgrößten Versicherungskonzerns Deutschlands. “Wir sehen deutliche Vorteile darin, wie Optimize die Prozessnotation BPMN nutzt, um intuitive Darstellungen der verfügbaren Daten anzubieten.”\n\nExperten gehen davon aus, dass der Markt für Workflow Automation von $4,7 Mrd. in 2017 auf beinahe $17 Mrd. in 2023 wachsen wird [1]. Im Rahmen der digitalen Transformation verlagern immer mehr Unternehmen ihre Aktivitäten in die Cloud, was die Komplexität und geografische Verteilung der zugrunde liegenden IT-Systeme dramatisch erhöht. Die entsprechenden Geschäftsprozesse sind hiervon ebenfalls betroffen, weshalb Lösungen zur Automatisierung und Echtzeit-Darstellung von Workflows zunehmend gefragt sind. Eine besondere Herausforderung stellt hierbei die massive Zunahme der digital abgewickelten Transaktionen dar, mit der traditionelle Workflow-Systeme häufig überfordert sind und die von Camunda unter dem Schlagwort “Big Workflow” explizit adressiert wird.\n\nFührungskräfte brauchen jederzeit verfügbare Einblicke in die Performance ihrer über mehrere IT-Systeme verteilten Kernprozesse, um sicherzustellen, dass die digitale Transformation gelingt. Optimize wurde dafür konzipiert, dieses wachsende Bedürfnis im Markt zu befriedigen, wie Camunda-Geschäftsführer Jakob Freund betont: “Optimize 2.0 vereint Workflow Automation mit Big Data, damit Führungskräfte jederzeit über ihre geschäftskritischen Kernprozesse im Bilde sind. Mit Hilfe von Reports, Dashboards, Alerts und Analytics können Optimize-Nutzer genau erkennen, welche Schritte im Prozess ausgeführt werden, wie lange diese brauchen und ob und warum bestimmte Vorgänge zu langsam sind. Mit Optimize 2.0 erfüllen wir unsere Mission, den Kreislauf der kontinuierlichen Prozessverbesserung für die digitale Transformation verfügbar zu machen.“\n\nKey Features\nOptimize 2.0 bietet einen Report Builder, Dashboard, Alerting und Korrelationsanalysen für Workflows, die auf der Camunda BPMN Engine ablaufen. Hierbei importiert die Anwendung im Sekundentakt die jeweils aktuellen Prozessdaten aus jeder der von Camunda unterstützten relationalen Datenbanken in ein big data repository (Elasticsearch), um entsprechend performante Queries zu erlauben.\n\n● Daten visualisieren  – Erstellung und Anpassung von Reports und Zusammenfassung mehrerer Reports in Monitoring Dashboards. Reports können klassische Visualisierungen wie Balken- und Liniendiagramme enthalten, aber auch BPMN-Diagramme nutzen, um mit Hilfe von Heatmaps die Identifikation häufig oder selten ausgeführter Prozesspfade oder die Verletzung von Durchlaufzeit-SLAs zu ermöglichen. Reports und Dashboards können in andere Webseiten wie z.B. Atlassian Confluence eingebettet werden, und die zugrunde liegenden Daten können als CSV-Dateien exportiert werden, um sie in externen Tools wie Microsoft Excel zu nutzen.\n\n● Alerting  – Anwender können Alerts konfigurieren, um Emails zu erhalten sobald bestimmte Schwellwerte über- oder unterschritten wurden. Auf diese Weise kann z.B. sichergestellt werden, dass die relevanten Stakeholder benachrichtigt werden, sobald bestimmte Vorgänge zu lange dauern oder eine inhaltliche Zielvorgabe für einen Prozess nicht erreicht wurde.\n\n● Advanced Analytics  – Prozesse finden häufig in unterschiedlichen Varianten statt, in Abhängigkeit von Daten oder Zwischenergebnissen. Diese Varianten werden durch verzweigte Pfade dargestellt, die zu einem späteren Zeitpunkt wieder zusammengeführt werden. Mit Optimize kann ermittelt werden, welche Auswirkung die jeweiligen Varianten auf das Erreichen unterschiedlicher Endzustände im Prozess haben. Somit kann z.B. statistisch ermittelt werden, ob in einem ECommerce-Prozess die Durchführung zusätzlicher Prüfschritte das Risiko erhöht, dass der Kunde seine Bestellung storniert.\n\n\nÜber Camunda\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Allianz Versicherungen, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\n\nMit seiner Open Source Platform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Business-Transaktionen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Infos unter https://camunda.com/de/\n\nPressekontakt:\nDarya Niknamian, Senior Marketing Manager, Camunda, darya.niknamian@camunda.com \n\n\n[1] MarketResearchNest, “2018-2023 Global and Regional Workflow Automation Industry Production, Sales and Consumption Status and Prospects Professional Market Research Report”\n\n","date":"2018-04-05","technicalName":"camunda-releases-first-application-combining-big-data-and-workflow-automation-to-provide-immediate-insight-into-revenue-generating-business-processes"},{"title":"IT-Umfrage: Microservices verbessern Effizienz und Nutzererlebnis","text":"__Berlin, 20. September 2018 – Die Unternehmen in der Europäischen Union entdecken die Vorteile einer IT-Architektur, die auf Microservices aufbaut. 69 Prozent versprechen sich davon eine höhere Effizienz bei der Zusammenarbeit. 58 Prozent erwarten ein besseres Nutzererlebnis. Die Folge: Wer von Microservices bereits gehört hat, setzt diese Art der Software-Entwicklung bereits in einem von zwei Fällen ein. Weitere 28 Prozent planen, auf diese Technologie umzusteigen. Jede siebte Firma möchte Anwendungen nur noch auf Basis von Microservices entwickeln. Das sind die Ergebnisse einer Anwenderstudie des Softwareunternehmens Camunda.__\n\nMicroservices bieten eine vergleichsweise kostengünstige Alternative zu einer Software, die alle Geschäftsvorfälle im Unternehmen durch eine zentrale Anwendung abbildet. Solche Systeme leiden darunter, dass selbst kleinste Anpassungen großen Aufwand nach sich ziehen können und sämtliche Nutzer betreffen. „Die Zukunft der Software-Entwicklung ist modular“, erklärt Jakob Freund, CEO und Mitgründer von Camunda. „Wenn mehrere Teams parallel an Microservices arbeiten, um so alle gewünschten Funktionen in die Gesamtlösung zu integrieren, treten weniger gravierende Fehler auf und die damit verbundenen Risiken lassen sich besser kontrollieren.“\n\nDiese Vorteile wollen die Unternehmen schon bald realisieren. EU-weit rechnen 69 Prozent damit, bereits bei der nächsten Generation ihrer Anwendungen stark oder sehr stark von Microservices zu profitieren. Der Grund: Abläufe lassen sich leichter automatisieren, wenn Kleinprogramme viele Teilschritte eines Geschäftsprozesses abbilden. Workflow-Engines sorgen anschließend dafür, dass einzelne Microservices ihre Aufgaben automatisch erledigen, sobald ein vorab definiertes Ereignis eintritt. „Wer online schon mal ein Flugticket gebucht hat, kennt das Prinzip“, sagt Camunda-CEO Freund. „Vereinfacht gesagt, löst der Kunde durch seine Buchung auf der Webseite einen Microservice aus, der die Bezahlung regelt. Sobald die Zahlung bestätigt ist, bekommt der Kunde durch einen weiteren Microservice automatisch eine Buchungsnummer für den Online-Check-In zugewiesen.“\n\nUnternehmen können diese Technik nutzen, um Prozesse aus allen Geschäftsbereichen abzubilden und das Kundenerlebnis zu verbessern. Dafür müssen die Verantwortlichen allerdings noch einige Hausaufgaben erledigen. So bemängeln 57 Prozent der Befragten, dass die Abläufe noch immer nicht vom Anfang bis zum Ende visualisiert sind (End-to-End). Das erschwert die Automatisierung von Prozessen, an denen mehrere Microservices beteiligt sind. Zudem sehen sich 54 Prozent mit Schwierigkeiten konfrontiert, falls Fehler an der Schnittstelle zwischen einzelnen dieser Dienste auftreten. „Durch Microservices steigt die Komplexität der Anwendungslandschaft an“, bestätigt Automatisierungsexperte Jakob Freund. „Prozesse sauber zu definieren und von Anfang bis Ende durchgängig zu steuern, ist für den erfolgreichen Einsatz von Microservices unerlässlich.“\n\n__Über die Umfrage__\n\nCamunda hat weltweit mehr als 350 Fachexperten online zur Entwicklung, Anwendung und Einführung von Software auf Basis von Microservices befragt, darunter mehrheitlich Software-Architekten (54 Prozent) und Software-Ingenieure (17 Prozent) sowie Business-Analysten, Produktmanager und Anwendungsentwickler. Die Umfrage wurde durchgeführt von Researchscape International. Auf die Europäische Union entfielen mit 186 Beteiligten mehr als die Hälfte der Antworten. Am stärksten vertreten sind Unternehmen aus den Branchen Finanzen, Versicherungen und Immobilien (28 Prozent), gefolgt von Software (27 Prozent), Telekommunikation (8 Prozent), Regierung (6 Prozent), Internet (5 Prozent) sowie Transport und Lagerhaltung (5 Prozent).\n\n__Über Camunda:__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Allianz Versicherungen, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Platform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Business-Transaktionen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Infos unter [https://camunda.com](https://camunda.com)\n\n__Pressekontakt:__\n\n__Deutschland:__\nFlorian Bongartz\nflorian.bongartz@econ-news.de\n+49 176 20250099\n\n__USA & International:__\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\ncamunda services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\nhttps://camunda.com \n","date":"2018-09-20","technicalName":"new-research-shows-63-percent-of-enterprises-are-adopting-microservices-architectures-yet-50-percent-are-unaware-of-the-impact-on-revenue-generating-business-processes"},{"title":"Umfrage: Jedes zweite EU-Unternehmen fürchtet digitale Disruption","text":"__Berlin, 27. September 2018 – In der Europäischen Union nimmt die Angst vor digitaler Disruption zu. 47 Prozent der Unternehmen geben an, dass in den vergangenen 18 Monaten bereits die Anzeichen für disruptive Veränderungen in der eigenen Branche teils massiv zugenommen haben. Von dieser Entwicklung bleibt kaum ein Industriezweig verschont. Nur zwölf Prozent der Firmen fühlen sich wenig oder gar nicht bedroht. Das zeigt eine Umfrage des Softwareunternehmens Camunda.__\n\nWie schnell sich ganze Branchen durch digitale Innovationen disruptieren lassen, haben Amazon, Netflix und zahlreiche Fintechs, die Banken mit komfortablen Digitallösungen ins Visier nehmen, längst bewiesen. Wann die Disruption tatsächlich stattfindet, schätzen jedoch viele Unternehmen falsch ein, glaubt Jakob Freund, CEO und Mitgründer von Camunda. „Amazon hat schon mit dem ersten online verkauften Buch einen Keil zwischen Kunde und Handel getrieben“, so der Experte für digitale Transformation. „Einbrechende Umsätze sind nur der Hebeleffekt einer Disruption, die bereits viel früher begonnen hat.“\n\nErfolgsentscheidend für das eigene Überleben ist deshalb, Frühindikatoren zu entwickeln, um disruptive Einflüsse im eigenen Geschäftsmodell rechtzeitig aufzuspüren. „Wenn sich Disruption schon aus den wirtschaftlichen Kennzahlen eines Unternehmens herauslesen lässt, ist es zu spät“, warnt Jakob Freund. Der beste Schutz gegen digitale Angreifer sei, selbst digitale Kompetenz aufzubauen, so der Camunda-Chef: „Die Unternehmen müssen ein neues Selbstverständnis als Softwarefirma aufbauen. Differenzierung findet künftig nur noch über die angebotenen Dienste statt. Es wird Softwarefirmen geben, die Bankdienstleistungen anbieten und solche, die Autos bauen. Ohne hausinterne, leistungsfähige Kapazitäten zur Softwareentwicklung kommt aber kein einziges Unternehmen mehr aus.“\n\n91 Prozent der EU-Firmen haben bereits verstanden, dass digitale Transformation der Schlüssel für langfristiges Wachstum darstellt. Dazu gehört vor allem, die eigene Organisation digital umzubauen und IT-Systeme zu entwickeln, die sich flexibel an sich ständig verändernde Kundenwünsche anpassen lassen. 56 Prozent der Befragten schätzen Microservices diesbezüglich als erfolgskritischen Faktor für die IT-Infrastruktur der Zukunft ein. Als besondere Herausforderung gilt hierbei die durchgängige Abbildung der Kerngeschäftsprozesse. Dies zeigt sich auch an den Aktivitäten von Microservices-Vorreitern wie dem US-Streamdingdienst Netflix, der seine eigene Lösung zur Orchestrierung von Microservices veröffentlicht hat (Quelle). „Microservices ermöglichen neuartige Anwendungen, die sich wie Lego-Bausätze zusammensetzen und erweitern lassen. Damit der Gesamtprozess dabei nicht aus dem Blick gerät, bietet sich eine durchgängige Unterstützung durch Workflow Automation Technologie an“, sagt Jakob Freund.\n\nIn den kommenden 18 Monaten erwartet der Camunda-Chef, dass sich ein Wettbewerb um die beste Kundenerfahrung entwickelt. „Im digitalen Zeitalter gewinnt, wer seine Kunden optimal bedient und diese Fähigkeit skalieren kann“, so Freund. „Entscheidend ist, dass auch eher konservative Produkte wie beispielsweise Versicherungen für den Kunden so einfach zu erwerben und nutzen sind wie ein Produkt bei Amazon.“\n\n__Über die Umfrage__\n\nCamunda hat weltweit mehr als 350 Fachexperten online zur Entwicklung, Anwendung und Einführung von Software auf Basis von Microservices befragt, darunter mehrheitlich Software-Architekten (54 Prozent) und Software-Ingenieure (17 Prozent) sowie Business-Analysten, Produktmanager und Anwendungsentwickler. Die Umfrage wurde durchgeführt von Researchscape International. Auf die Europäische Union entfielen mit mehr als 100 Beteiligten rund ein Drittel der Antworten. Am stärksten vertreten sind Unternehmen aus den Branchen Finanzen, Versicherungen und Immobilien (28 Prozent), gefolgt von Software (27 Prozent), Telekommunikation (8 Prozent), Regierung (6 Prozent), Internet (5 Prozent) sowie Transport und Lagerhaltung (5 Prozent).\n\n__Über Camunda:__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Allianz Versicherungen, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Platform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Business-Transaktionen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Infos unter https://camunda.com\n\nPressekontakt:\n\nDeutschland:\nFlorian Bongartz\nflorian.bongartz@econ-news.de\n+49 176 20250099\n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\nAbsender:\n\ncamunda services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\nhttps://camunda.com \n","date":"2018-09-27","technicalName":"survey-nearly-50-of-eu-companies-worry-about-digital-disruption"},{"title":"Finanzierung: Berliner Softwarefirma Camunda erhält 25 Mio. Euro","text":"__Berlin, 5. Dezember 2018 – Die Investmentgesellschaft Highland Europe steckt 25 Mio. Euro in das IT-Unternehmen Camunda. Die Berliner Firma, die Open Source Software für die Automatisierung von Geschäftsprozessen entwickelt, erhält erstmals eine Finanzspritze durch einen externen Partner (Series A Funding). Der Trend in Deutschland geht seit längerem zu Later-Stage-Finanzierungen in Unternehmen, die von der Startup- in die Wachstumsphase übergegangen sind. In den letzten 12 Monaten beispielsweise hat Camunda seinen Umsatz mehr als verdoppelt und seit der Gründung im Jahr 2008 stets Gewinne ausgewiesen.__\n\n„Die digitale Transformation entwickelt sich zu einem zentralen Wachstumstreiber über alle Industrien hinweg“, sagt Sam Brooks, Partner bei Highland Europe. „Dafür ist die Automatisierung von Geschäftsprozessen unerlässlich. Camunda überzeugt in diesem Marktumfeld durch ein perfekt auf Software-Entwickler abgestimmtes Produkt, effizienten Kapitaleinsatz und große Ambitionen für die Zukunft. Wir beobachten das Unternehmen bereits seit Jahren und freuen uns darauf, gemeinsam mit Camunda in die nächste Wachstumsphase einzusteigen und im Bereich Workflow-Automatisierung eine dauerhafte Spitzenposition einzunehmen.“\n\nMehr als 200 Unternehmen aus verschiedenen Branchen nutzen heute schon die von Camunda entwickelte Software, um beispielsweise Internetkäufe abzuwickeln, Versicherungsansprüche zu regulieren oder Wertpapiergeschäfte zu tätigen. Zu den Kunden des Unternehmens zählen unter anderem die Deutsche Bahn, das Musiklabel Universal Music Group und der Online-Modehändler Zalando. „Die Unternehmen setzen unsere Software ein, um veraltete Großsysteme durch flexible IT-Architekturen zu ersetzen, die das eigene Geschäftsmodell besser abbilden“, erklärt Jakob Freund, Mitbegründer und CEO von Camunda.\n\nDas sei eine wesentliche Voraussetzung für die digitale Transformation. Jedes Unternehmen, so der Camunda-Chef, müsse sich zu einem Software-Unternehmen entwickeln, um Wettbewerbsvorteile in digitalisierten Märkten erzielen zu können. „Wir erleben einen Wandel von der Produktions- zur Erlebnisökonomie“, sagt Freund. „Künftig gewinnt, wer seinen Kunden das beste Nutzererlebnis bietet. Das erfordert exzellente IT-Systeme und weitgehend automatisierte Geschäftsprozesse. Wir freuen uns, dass Highland Europe diese Vision teilt und uns durch zusätzliches Kapital ermöglicht, weiter zu expandieren, ohne bei der Produktinnovation Kompromisse einzugehen.“\n\n__Technischer Hintergrund__\n\nCamundas gleichnamige Open Source Workflow-Engine deckt alle Phasen der Workflow-Automatisierung ab, vom Prozessdesign über die Ausführung bis zur Prozessverbesserung. Der Camunda-Stack beinhaltet darüber hinaus ein BPMN-konformes Werkzeug zum Modellieren und Ausführen von Geschäftsprozessen sowie visuelle Schnittstellen, die aktive Prozesse überwachen, die Behebung von Fehlern erleichtern und große Prozessdatenmengen analysieren können. Die Software wurde speziell für Entwickler erstellt, die für die eigene Organisation eine nahtlose Integration in die bestehende IT-Landschaft benötigen.\n\n__Über Camunda:__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Platform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Business-Transaktionen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter https://camunda.com\n\n__Über Highland Europe__\n\nHighland Europe investiert in außergewöhnliche Wachstums- und Softwareunternehmen und Internetunternehmen. Highland Europe ist seit 2003 als Highland Capital Partners in Europa aktiv und wurde 2012 offiziell gegründet. Das Unternehmen hat über 1 Milliarde Euro aufgebracht und in Unternehmen wie Adjust, Bitmovin, ContentSquare, Featurespace, GetYourGuide, Huel, Malwarebytes, MatchesFashion, NewVoiceMedia, Nexthink, Smart.io und WeTransfer investiert. Highlands Investitionsgeschichte in den USA, Europa und China umfasst 46 Börsengänge und 19 Unternehmen, die mehr eine Milliarde US-Dollar wert sind. Mehr Informationen unter: www.highlandeurope.com.\n\n__Pressekontakt:__\n\nDeutschland:\nFlorian Bongartz\nflorian.bongartz@econ-news.de \n+49 176 20250099\n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\nhttps://camunda.com \n\n\n","date":"2018-12-05","technicalName":"workflow-automation-innovator-camunda-secures-25-million-in-series-a-funding"},{"title":"PwC kooperiert mit Berliner Software-Entwickler Camunda","text":"•\tWorkflow-Automatisierung ist zentrales Element der Digitalisierung\n•\tPwC-Kunden profitieren künftig von umfassender Unterstützung bei der Automatisierung von Prozessen\n•\tMarkt für Workflow-Automatisierung steigt bis 2023 auf 17 Milliarden US-Dollar\n\n__Düsseldorf und Berlin, 29. April 2019__ Die Wirtschaftsprüfungs- und Beratungsgesellschaft PricewaterhouseCoopers (PwC) wird Mitglied des Partner-Programms von Camunda, einem Software-Hersteller für Prozessautomatisierung. Im Rahmen der Kooperation haben PwC-Kunden die Möglichkeit, die Produkte sowie die Plattform von Camunda zu nutzen, um ihre digitale Transformation voranzutreiben. \n\n„Wer im heutigen Geschäftsumfeld wettbewerbsfähig bleiben will, muss die digitale Transformation intelligent angehen und Arbeitsabläufe automatisieren. Dafür braucht es eine Plattform, die sich mit dem wachsenden Unternehmen weiterentwickelt“, kommentiert Jakob Freund, CEO und Mitgründer des Software-Unternehmens Camunda, das eine solche Lösung entwickelt hat.\n\nAls Camunda-Partner bietet PwC seinen Kunden Zugang zu dieser Plattform, die alle Phasen der Workflow-Automatisierung abdeckt: von der Gestaltung der Prozesse über die Ausführung bis hin zu fortlaufenden Verbesserungen. „Wir freuen uns sehr darauf, mit Camunda zusammenzuarbeiten. Durch die Partnerschaft können wir unseren Kunden eine schlanke, flexible Open-Source-Plattform bieten und ihnen dabei helfen, ihre Arbeitsabläufe zu automatisieren und die digitale Transformation zu beschleunigen“, kommentiert PwC-Partner Sven Kilz. \n\nExperten gehen davon aus, dass der Markt für Workflow-Automatisierung bis zum Jahr 2023 auf 17 Milliarden US-Dollar pro Jahr steigen wird. 2017 lagen die Umsätze in diesem Segment bei knapp 5 Milliarden US-Dollar.\n\n__Pressekontakt:__\n\nSebastian Göb \nPwC | Marketing & Communications\nPhone: +49 211 9815189 \nMobile: +49 160 91748524\nEmail: sebastian.goeb@pwc.com\n\nJessica Jaffe\nCamunda | Sift Communications \nEmail: Jessica.Jaffe@siftpr.com \n\n\n--\n\n__Über PwC__\nPwC betrachtet es als seine Aufgabe, gesellschaftliches Vertrauen aufzubauen und wichtige Probleme zu lösen. Mehr als 250.000 Mitarbeiter in 158 Ländern tragen hierzu mit hochwertigen, branchenspezifischen Dienstleistungen in den Bereichen Wirtschaftsprüfung, Steuer- und Unternehmensberatung bei.\nDie Bezeichnung PwC bezieht sich auf das PwC-Netzwerk und/oder eine oder mehrere der rechtlich selbstständigen Netzwerkgesellschaften. Weitere Details unter www.pwc.com/structure.\n\n\n__Über Camunda__\nCamunda ist ein Softwarehersteller, der sich auf die Automatisierung von Prozessen spezialisiert hat. Das Unternehmen wurde 2008 gegründet und beschäftigt rund 100 Mitarbeiter am Hauptsitz in Berlin und an zwei Standorten in den USA (San Francisco und Denver). Camunda unterstützt seine Kunden dabei, Kernprozesse im Zuge der digitalen Transformation zu automatisieren. Zu den Kunden zählen unter anderem 24 Hour Fitness, AT&T, Lufthansa Technik und Zalando. Weitere Details unter https://camunda.com/.\n \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\nhttps://camunda.com \n\n\n","date":"2019-04-29","technicalName":"pwc-partners-with-camunda-to-drive-digital-transformations"},{"title":"Workflow Automation: Infosys tritt Camunda Partnerprogramm bei","text":"__Berlin, 23. Mai 2019__ -- Veraltete IT-Systeme behindern den digitalen Umbau der globalen Wirtschaft. Das IT-Unternehmen Infosys tritt deshalb dem Partnerprogramm der Berliner Softwarefirma Camunda bei. Infosys-Kunden erhalten ab sofort Zugriff auf die von Camunda entwickelten Technologien für Workflow- und Entscheidungsautomatisierung.\n\nInfosys will die eigenen Kunden dabei unterstützen, selbst Software zu entwickeln und schwerfällige Altsysteme abzulösen. Dafür eignen sich Open-Source-Systeme wie Camunda, weil sie sich leicht anpassen lassen und viele interne Abläufe automatisieren können. „Altsysteme behindern die digitale Transformation so stark, dass sie das aktive Geschäft gefährden“, sagt Gautam Khanna, der bei Infosys-Kunden weltweit die Projekte zur IT-Modernisierung verantwortet. „Durch die Partnerschaft mit Camunda ermöglichen wir den Unternehmen, auf einer schlanken und entwicklerfreundlichen Software-Plattform eigenständig Prozesse zu modellieren und ganze Workflows zu automatisieren.“\n\nSoftware selbst zu entwickeln und eigenes Anwenderwissen aufzubauen, löst auch das zweite große Problem vieler Unternehmen: fehlendes Budget. Häufig stockt die Digitalisierung, weil zu wenig oder gar kein Geld dafür da ist. Vielmehr verschlingen die veralteten IT-Systeme beträchtliche Summen für Lizenzen, Wartung und teure Erweiterungen. „Viele Unternehmen spüren den Druck, ihre Geschäftsabläufe zu digitalisieren und mehr eigenes Know-how aufzubauen“, sagt Jakob Freund, CEO von Camunda. „Unsere Partnerschaft mit Infosys trägt dazu bei, dass noch mehr Unternehmen die digitale Transformation angehen können.“\n\nAls Mitglied im Camunda-Partnerprogramm kann Infosys eigenen Kunden jetzt einen einfachen Zugang zur Camunda-Plattform anbieten, die alle Phasen der Workflow-Automatisierung abdeckt – von der Prozessgestaltung und -ausführung bis hin zu zur kontinuierlichen Verbesserung. Camunda ermöglicht, Prozesse zu modellieren, auszuführen und über visuelle Schnittstellen zu steuern. So lassen sich aktive Prozesse überwachen und auftretende Fehler schnell beheben. Zudem kann Infosys bewährte ISO-Standards für BPMN nutzen, die Camunda mitgestaltet hat. Hinzu kommen passende Schulungsprogramme wie das Standardwerk ‚Real-Life BPMN‘.\n\n\n__Pressekontakt:__\n\nFlorian Bongartz\nCamunda\nEmail: florian.bongartz@econ-news.de\n\n\n--\n\n__Über Camunda__\nCamunda ist ein Softwarehersteller, der sich auf die Automatisierung von Prozessen spezialisiert hat. Das Unternehmen wurde 2008 gegründet und beschäftigt rund 100 Mitarbeiter am Hauptsitz in Berlin und an zwei Standorten in den USA (San Francisco und Denver). Camunda unterstützt seine Kunden dabei, Kernprozesse im Zuge der digitalen Transformation zu automatisieren. Zu den Kunden zählen unter anderem 24 Hour Fitness, AT&T, Lufthansa Technik und Zalando. Weitere Details unter https://camunda.com/.\n \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\nhttps://camunda.com \n\n\n","date":"2019-05-23","technicalName":"camunda-expands-partner-network-with-infosys-to-provide-open-source-workflow-automation"},{"title":"Workflow Modellierung: Software Cawemo ab sofort kostenfrei","text":"__Berlin, 28. Mai 2019__ -- Unternehmen, die ihre Abläufe als Workflows abbilden, können dafür jetzt die Software Cawemo kostenfrei verwenden. Anbieter Camunda schafft die monatliche Gebühr für Neukunden und die mehr als 20.000 bereits registrierten Benutzer ab. So will der Berliner Entwickler dafür sorgen, dass sich mehr Firmen mit Workflows beschäftigen und die Modellierungssprache BPMN besser verstehen. Auf der Webseite [www.cawemo.com](https://www.cawemo.com) können sich Interessierte anmelden und die Cloud-Software sofort nutzen.\n\nCawemo wird vor allem in Projekten genutzt, die darauf abzielen, Abläufe zu digitalisieren und möglichst automatisiert ausführen zu lassen. Beispielsweise lassen sich Bestellungen in einem Onlineshop als Workflow darstellen: kauft ein Kunde im Webstore ein, wird etwa geprüft, ob die gewünschte Ware vorrätig ist und falls ja, sofort verschickt. Anschließend erhält der Kunde seine Rechnung elektronisch zugestellt und bezahlt über ein voreingestelltes Zahlungsmittel wie die Kreditkarte oder per SEPA-Lastschrift. „Wer Cawemo nutzt, bekommt einen leicht verständlichen Überblick über alle geschäftlichen Abläufe“, erklärt Volker Gersabeck von Camunda.\n\nDie Software erleichtert vor allem weniger IT-affinen Kollegen wie Business Analysten oder Produktmanagern, Abläufe zu modellieren und gemeinsam daran zu arbeiten. Dafür brauchen die Mitarbeiter kaum technische Vorkenntnisse. Sie müssen sich nur an die einheitliche Modellierungssprache BPMN (Business Process Model and Notation) halten, damit Cawemo die Abläufe grafisch und damit besser verständlich darstellen kann. Die Workflow-Diagramme lassen sich zudem in Webseiten wie Confluence einbetten, als Grafik für Textdokumente wie Microsoft Word exportieren oder direkt in den Modeler, das Entwicklerwerkzeug des Camunda Stacks, laden. „Cawemo funktioniert wie ein zentrales Repository für Prozesse, an denen mehrere Projektteams gleichzeitig arbeiten können“, sagt Camunda-Experte Gersabeck.\n\nIn Kürze soll Cawemo darüber hinaus stärker mit der Camunda Workflow Engine verbunden werden. Das Ziel: Mit der Workflow Automation Software Camunda entwickelte Workflows in Cawemo exportieren, damit auch technisch weniger versierte Kollegen im Unternehmen an den Spezifikationen für geschäftliche Abläufe arbeiten können. Unternehmen, die bereits über eine Camunda Enterprise Lizenz verfügen, erhalten ebenfalls kostenlosen Zugriff auf Cawemo. „Wir wollen, dass Unternehmen stärker in Prozessen denken“, so Gersabeck. „Ein Workflow Modeler wie Cawemo macht das so einfach wie möglich für so viele Mitarbeiter wie möglich.“\n\nBisher haben Unternehmen pro Benutzer ein monatliches Abonnement für Cawemoabschließenmüssen. Diese Preisschranke fällt künftig weg. So will Camunda auch die Einstiegshürde für seine gleichnamige Workflow Engine senken. Der Camunda Stack wird derzeit als Open Source angeboten sowie in einer Enterprise Lizenzlösung mit professionellem Support.\n\n\n\n__Pressekontakt:__\n\nFlorian Bongartz\nCamunda\nEmail: florian.bongartz@econ-news.de\n\n\n--\n\n__Über Camunda__\nCamunda ist ein Softwarehersteller, der sich auf die Automatisierung von Prozessen spezialisiert hat. Das Unternehmen wurde 2008 gegründet und beschäftigt rund 100 Mitarbeiter am Hauptsitz in Berlin und an zwei Standorten in den USA (San Francisco und Denver). Camunda unterstützt seine Kunden dabei, Kernprozesse im Zuge der digitalen Transformation zu automatisieren. Zu den Kunden zählen unter anderem 24 Hour Fitness, AT&T, Lufthansa Technik und Zalando. Weitere Details unter https://camunda.com/.\n \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\nhttps://camunda.com \n\n\n","date":"2019-05-28","technicalName":"camunda-to-offer-collaborative-workflow-modeling-tool-cawemo-for-free"},{"title":"Mphasis kooperiert mit Camunda, um die Workflow- und Decision Automation der Kunden zu verbessern.","text":"__Berlin, 10. Juni 2019__ - Viele IT-Systeme in Banken und Versicherungen sind mit der Aufgabe überlastet, Daten schnell auszutauschen und mit digitalen Angeboten zu verknüpfen. Der Spezialist für Cloud Cognitive Services, Mphasis, schließt sich daher dem Partnerprogramm des Berliner Softwareentwicklers Camunda an.\n\nMphasis will die Vermögensverwaltung durch kognitive Dienste und künstliche Intelligenz verbessern. Dabei setzt das Unternehmen auf Software aus der Cloud, mit der Banken und Versicherungen neue Produkte schneller zur Marktreife bringen und Kunden besser beraten können. Dies wird derzeit vor allem durch veraltete IT-Infrastrukturen behindert, die viel Zeit für die Bereitstellung und Verarbeitung von Informationen benötigen. \n\n\"Diese Partnerschaft mit Camunda bietet Unternehmen die Möglichkeit, Kundenbedürfnisse schneller zu erfüllen, indem sie die Kundenerfahrungen hyper-personalisieren. Es unterstreicht unser Engagement, Unternehmenskunden dabei zu unterstützen, schnell überlegene Produkte und Serviceerfahrungen zu liefern, gleichzeitig die Kosten zu optimieren und kritische Multi-Cloud-Betriebsstrategien zu vereinfachen\", sagte Dinesh Venugopal, President - Mphasis Direct and Digital. \n\nCamunda BPM ist die richtige Lösung. Die Open-Source-Plattform für Workflow- und Entscheidungsmanagement automatisiert interne Prozesse und nutzt Mikroservices, um verschiedene Aufgaben innerhalb einer Geschäftsbeziehung zu bewältigen. Damit entspricht diese Plattform den Bedürfnissen vieler Mphasis-Kunden nach einer Plattform, die sich leicht in die eigene Softwareentwicklung und moderne Benutzeroberflächen integrieren lässt. \"Die digitale Transformation zwingt immer mehr Unternehmen, eine eigene Software zu entwickeln und flexibler auf den Markt zu reagieren\", sagt Jakob Freund, CEO von Camunda. \"Wir freuen uns, mit Mphasis zusammenzuarbeiten, um diese Fähigkeit für unsere Kunden weiterzuentwickeln.\n\n__Über Mphasis__\n\n[Mphasis](http://www.mphasis.com/ \"Mphasis\") (BSE: 526299; NSE: MPHASIS) wendet Technologien der nächsten Generation an, um Unternehmen bei der globalen Transformation zu unterstützen. Kundenorientierung ist für Mphasis von grundlegender Bedeutung und spiegelt sich im Front2Back -Transformationsansatz wider. Front2Back nutzt die exponentielle Kraft von Cloud und Cognitive, um Kunden und deren Endkunden ein hyperpersonalisiertes, digitales Erlebnis zu bieten. Der Service Transformation-Ansatz von Mphasis hilft dabei, durch den Einsatz digitaler Technologien den Kern in Legacy-Umgebungen innerhalb eines Unternehmens zu verkleinern und ihnen so die Möglichkeit zu geben, in einer sich verändernden Welt stets einen Schritt voraus zu sein. Die Kernreferenzarchitekturen und -tools von Mphasis sowie Schnelligkeit und Innovation sind der Schlüssel zum Aufbau enger Beziehungen zu Kunden. Mehr Informationen unter [https://www.mphasis.com](https://www.mphasis.com \"https://www.mphasis.com\") \n\n__Über Camunda__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Plattform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Geschäftsprozessen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter [https://camunda.com](https://camunda.com \"https://camunda.com\")\n\n__Pressekontakt:__\n\nDeepa Nagraj\nMphasis Corporate Communications \ndeepa.nagaraj@mphasis.com\n+1 (347) 268-0661 | +1 (646) 424-5160\n+91 9845 256 283\n\nSumana Bhat\nMphasis Corporate Communications \nSumana.bhat@mphasis.com\n09902980980\n\nDeutschland:\nFlorian Bongartz\nflorian.bongartz@econ-news.de\n+49 176 20250099\n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\n\n","date":"2019-06-10","technicalName":"mphasis-partners-with-camunda-to-boost-clients-workflow-and-decision-automation-capabilities"},{"title":"Umfrage: Banken fordern höhere Zinsen und weniger Regeln","text":"•\tSchlechte Ertragslage behindert digitale Transformation\n•\tMehrheit will Software künftig selbst entwickeln\n\n__Berlin, 18. Juni 2019__ – Nach dem Willen der EZB bleiben die Nullzinsen im Euroraum noch mindestens bis 2020 bestehen. Viele Banken stellt das vor ernsthafte Probleme. 80 Prozent der Institute sagen, dass die Zinsen steigen müssen, damit sie wieder Geld verdienen. Drei Viertel verlangen von der Politik, Banken besser zu schützen und mehr zu deregulieren. Das geht aus einer Umfrage der Software-Firma Camunda hervor. 102 Führungskräfte und Projektleiter wurden befragt.\n\nDie schwachen Erträge wirken sich auch darauf aus, wie schnell die Banken ihre Geschäfte digital umgestalten können. 59 Prozent der Institute geben an, dass ihnen die finanziellen Spielräume dafür fehlen – Mittel, die sich auch wegen der Nullzinspolitik nur noch schwer verdienen lassen. Viele gesetzliche Vorschriften, die von den Geldhäusern derzeit umgesetzt werden müssen, erhöhen den Druck zusätzlich. 76 Prozent erklären, dass zu viel Regulatorik sie daran hindert, sich um die digitale Transformation zu kümmern. „Jetzt rächt sich, dass viele Banken bei ihrer Kern-IT auf fremde Hilfe angewiesen sind“, sagt Jakob Freund, CEO von Camunda.\n\nDie Institute kämpfen beispielsweise mit der europäischen Zahlungsdiensterichtlinie PSD II. Wenn die Kunden einverstanden sind, dürfen auch andere Unternehmen als die Hausbank auf ihre Konten zugreifen und sogar elektronisch Zahlungen auslösen. Verbraucher benötigen so etwa nur eine einzige App, um alle ihre Konten auf einen Blick zu verwalten. Gleichzeitig sollen besonders starke Authentifizierungen dafür sorgen, dass Geld zu überweisen sicherer wird. Doch dafür mussten die Banken teils tief in die eigenen IT-Systeme eingreifen und digitale Schnittstellen bereitstellen. Am 14. September 2019 läuft die Frist dafür ab. „Die Systeme zu öffnen, ist deshalb so aufwendig, weil die die Kernbank-IT dafür nicht ausgelegt ist“, so Freund. \n\nViele Banken rechnen wohl damit, dass sie künftig eher häufiger als seltener ihre IT anzupassen haben. Sie steuern daher jetzt um. 71 Prozent der Geldhäuser sind dabei oder planen konkret damit, ihre IT-Abteilungen so auszubauen, dass sie Software auch selbst entwickeln können. Zwei Drittel setzen dafür sogar auf eine eigenständige Abteilung. „Software selbst entwickeln zu wollen, ist die richtige Strategie“, erklärt Camunda-Chef Jakob Freund. „Global Player wie Goldman Sachs sehen sich selbst schon seit Jahren eher als Technologiefirmen und nicht allein als Bank.“\n\n__Über die Umfrage__\n\nIm Mai 2019 hat Camunda 102 Führungskräfte und Projektleiter in Banken über die digitale Transformation befragt. Die Antworten wurden online gegeben. Die Ergebnisse können unter folgender Internetadresse angefordert werden: https://camunda.de/bank2019 \n\n__Über Camunda__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Plattform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Geschäftsprozessen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter https://camunda.com\n\n__Pressekontakt:__\n\nDeutschland:\nFlorian Bongartz \nflorian.bongartz@econ-news.de  \n+49 176 20250099\n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\n","date":"2019-06-18","technicalName":"umfrage-banken-fordern-hohere-zinsen-und-weniger-regeln-german-only"},{"title":"","text":"","date":"2019-06-24","technicalName":"camunda-announces-extensive-speaker-lineup-for-camundacon-2019"},{"title":"Umfrage: Zwei Drittel der Versicherer entwickeln Software selbst","text":"\n\n•\t65 Prozent der Anbieter automatisieren ihre Abläufe\n•\tJede zweite Versicherung will eigene Startups gründen\n•\tAssekuranzen müssen bei Schnittstellen (API) aufholen\n\n\n\n__Berlin, 25. Juni 2019__ – Zwei von drei Versicherern in Deutschland wollen selber Software entwickeln. Mehr als die Hälfte hat damit schon begonnen, jede siebte steht kurz davor, das zu machen. Dabei werden sowohl bestehende IT-Abteilungen erweitert als auch neue Teams gegründet, die sich nur damit beschäftigen sollen. Die Branche macht sich so unabhängiger von Dienstleistern. Das ist das Ergebnis einer Umfrage der Software-Firma Camunda.\n\nEine eigene Software-Entwicklung erleichtert vielen Anbietern, bei neuen Angeboten zur digitalen Konkurrenz aufzuschließen. 65 Prozent der Assekuranzen arbeiten an besseren Apps und digitalen Abschlüssen. 61 Prozent investieren darin, gemeldete Schäden möglichst digital zu bearbeiten. Die Anbieter setzen dabei auch auf schnellere Abläufe. 64 Prozent wollen sowohl intern wie auch zum Kunden ihre Prozesse automatisieren. „Wer Software selbst entwickelt, kann viel schneller auf die Wünsche seiner Kunden reagieren“, sagt Jakob Freund, CEO von Camunda. „Unternehmen, die ihre digitalen Angebote nicht selbst herstellen können, geben ihre Zukunft aus der Hand.“\n\nDie Assekuranzen gehen zudem mehr Experimente ein. 46 Prozent planen, schon bald eigene Startups zu gründen und so ihre digitalen Kompetenzen zu stärken. 31 Prozent gehören zu den Pionieren, die das schon getan haben. Sieben von zehn Versicherern arbeiten zudem bereits mit Insurtechs zusammen oder wollen das noch machen. Open Source spielt dabei auch eine immer stärkere Rolle. 39 Prozent arbeiten bereits mit quelloffener Software, weitere 19 Prozent planen damit. „Wer Software selbst entwickelt, kann mit Open Source das Know-how einer ganzen Community nutzen, um die eigenen Produkte zu verbessern“, so Jakob Freund.\n\nDamit die alte und die neue Welt später zusammenwachsen können, müssen die Versicherer aber noch mehr tun. Gerade mal die Hälfte arbeitet beispielsweise daran, verschiedene digitale Angebote über Schnittstellen (API) miteinander zu verbinden. 40 Prozent der Anbieter beschäftigt sich damit noch überhaupt nicht. Immerhin wollen weitere zehn Prozent bald nachziehen. Das empfiehlt auch Camunda-Chef Jakob Freund: „Ein hochwertiger Technologie-Stack braucht Schnittstellen, damit sich die Prozesse auch dann end-to-end automatisieren lassen, wenn Partner dabei eingebunden werden müssen.“\n\n__Über die Umfrage__\n\nIm Mai 2019 hat Camunda 104 Führungskräfte und Projektleiter in Banken über die digitale Transformation befragt. Die Antworten wurden online gegeben. Die Ergebnisse können unter folgender Internetadresse angefordert werden: https://camunda.de/versicherung2019 \n\n__Über Camunda__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Plattform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Geschäftsprozessen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter https://camunda.com\n\n__Pressekontakt:__\n\nDeutschland:\nFlorian Bongartz\nflorian.bongartz@econ-news.de\n+49 176 20250099\n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\n\n","date":"2019-06-25","technicalName":"umfrage-zwei-drittel-der-versicherer-entwickeln-software-selbst"},{"title":"Umfrage: Banken fürchten Apple, Google und Paypal am meisten","text":"•\tBundesbank-Forderung: 78 Prozent investieren in Echtzeitzahlungssysteme\n•\tBanken kämpfen mit zu langsamen IT-Systemen und zu vielen manuellen Abläufen\n•\tKernbankensysteme schneiden schlecht ab bei der Geschwindigkeit\n\n__Berlin, 4. Juli 2019__ – Apple, Google und Paypal gefährden die Erträge deutscher Banken am stärksten. 74 Prozent der Institute fürchten sich davor, dass ihnen die mobilen Bezahlsysteme aus dem Silicon Valley immer mehr Kunden abjagen. Zwei Drittel gehen davon aus, auch bei klassischen Kontodiensten weniger Geld zu verdienen. Der Grund: Smartphone-Banken, die mit einfach zu bedienenden Apps zunehmend Anklang finden. Das geht aus einer Umfrage der Software-Firma [Camunda](https://camunda.com/ \"Camunda\") hervor.\n\nDie deutsche Bundesbank fordert die Institute jetzt zur Gegenwehr auf, weil sich weiter sinkende Erträge irgendwann auch auf die finanzielle Stabilität auswirken könnten. Im Zahlungsverkehr soll deshalb eine europäische Alternative her. Zwar investieren 78 Prozent der Banken in Systeme, die Zahlungen in Echtzeit abwickeln können. Doch die meisten Institute arbeiten immer noch daran, sich digital zu transformieren. 71 Prozent bemängeln zu langsame IT-Systeme. 63 Prozent möchten gerne weniger manuell erledigen müssen. „Viele digitale Angebote sehen gut aus, laufen aber noch mit veralteter Technik“, sagt Jakob Freund, CEO von Camunda.\n\nMit der überholten IT haben auch die Mitarbeiter zu kämpfen. 54 Prozent bewerten ihre IT-Systeme generell als anfällig für Fehler. Die eingesetzten Werkzeuge gelten als undurchsichtig. Das liegt vor allem an der überalterten Kernbank-IT, die kaum ein Institut selbst entwickelt hat. Zudem schneiden die IT-Kernsysteme bei der Performance schlecht ab. Beispielsweise zeigen sich nur etwas mehr als die Hälfte zufrieden oder sehr zufrieden mit der Geschwindigkeit, in der die nächtlichen Buchungen ablaufen. „Banken müssen ihre Kernsysteme ablösen und sollten lernen selbst zu programmieren“, erklärt Jakob Freund. „In der digitalen Welt gewinnt, wer über die besten Anwendungen verfügt.“\n\nMehr als zwei Drittel der Institute haben diesen Weckruf bereits gehört. Sie wollen Software künftig selbst entwickeln. Dazu gehören für viele Banken inzwischen auch quelloffene Module. 54 Prozent setzen Open Source bereits ein, weitere 20 Prozent planen das. „Open Source erspart den Banken sehr viel Arbeit, solange sie ihren Technologie-Stack selbst beherrschen und nicht von Herstellern und deren Innovationskraft abhängen“, so Freund.\n\n__Über die Umfrage__\n\nIm Mai 2019 hat Camunda 102 Führungskräfte und Projektleiter in Banken über die digitale Transformation befragt. Die Antworten wurden online gegeben. Die Ergebnisse können unter folgender Internetadresse angefordert werden: https://camunda.de/bank2019 \n\n__Über Camunda__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Plattform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Geschäftsprozessen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter https://camunda.com\n\n__Pressekontakt:__\n\nDeutschland:\nFlorian Bongartz\nflorian.bongartz@econ-news.de\n+49 176 20250099\n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\n","date":"2019-07-04","technicalName":"umfrage-banken-furchten-apple-google-und-paypal-am-meisten"},{"title":"Umfrage: Versicherer fürchten Online-Konkurrenz am meisten","text":"•\tDigitale Angreifer gefährlicher als niedrige Zinsen im Bereich Leben\n•\tSoftware entscheidet künftig über das beste Kundenerlebnis\n•\tVersicherungs-IT soll flexibler werden\n\n__Berlin, 11. Juli 2019__ – Deutsche Versicherer zittern vor der digitalen Konkurrenz. Die größten Sorgen lösen dabei Direktversicherungen aus, die sich online abschließen lassen. 77 Prozent der Manager erklären, dass dies die eigenen Erträge am stärksten angreift. Drei Viertel stufen zudem reine Online-Makler als bedrohlich ein. Damit liegen die digitalen Risiken noch vor den niedrigen Zinsen, die vielen Anbietern das Geschäft im Bereich Leben vermiesen. Das zeigt eine Umfrage der Software-Firma [Camunda](https://camunda.com/de/ \"Camunda\").\n\nNeue Risiken zeichnen sich darüber hinaus durch Deckungen ab, die sich mit kurzen Laufzeiten oder auch spontan abschließen lassen. Sieben von zehn Anbietern befürchten, dass sie durch Tarife Kunden verlieren, die sie von einen Tag auf den anderen buchen und wieder kündigen können. On-Demand oder Kurzzeittarife gelten für 69 Prozent als gefährlich für den eigenen Umsatz. 65 Prozent gehen davon aus, dass sich über Apps gekaufte Versicherungen als problematisch erweisen könnten, mehr noch als verhaltensabhängige Tarife. „Künftig versichert sich der Kunde dort, wo der Schutz besonders einfach und unkompliziert zu bekommen ist“, sagt Jakob Freund, CEO von Camunda.\n\nZwar belegen Umfragen, dass der persönliche Kontakt gerade bei sensiblen Themen noch nicht ausgedient habe. Doch bei leicht zu vergleichenden Angeboten wie einer privaten Haftpflicht-, Hausrat- oder Kfz-Versicherung trauen sich Verbraucher häufig selbst zu, den passenden Tarif zu finden. Sie erwarten, dass sie in solchen Fällen schnell den gewünschten Schutz buchen können, ohne langwierige Gespräche führen oder seitenlange Bedingungen lesen zu müssen. „Über das beste Kundenerlebnis entscheidet die beste Software“, erklärt Jakob Freund. „Je besser die Software, desto eher ist das für leidige Thema Versicherungen abgehakt.“\n\nDafür müssen die Anbieter aber noch viel tun. 89 Prozent der Manager erwarten von der IT, dass sie leicht zu verstehen und übersichtlich gestaltet ist. Zudem drängen 88 Prozent darauf, dass sich neue Produkte leichter durch die eingesetzte Software abbilden lassen und individuelle Wünsche besser umgesetzt werden. Als Problem gelten dabei häufig starr vorgegebene Release-Zyklen. 83 Prozent fordern, flexibler handeln zu können. Auch Teile einzelner Programme sollen sich bestenfalls ohne größeren Aufwand anpassen lassen. „Viel spricht dafür, große System-Suiten abzulösen durch selbst entwickelte Software“, fasst Jakob Freund zusammen. „Microservices eignen sich für eine moderne Versicherungs-IT, die sich mit den Insurtechs messen kann.“\n\n__Über die Umfrage__\n\nIm Mai 2019 hat Camunda 104 Führungskräfte und Projektleiter in Banken über die digitale Transformation befragt. Die Antworten wurden online gegeben. Die Ergebnisse können unter folgender Internetadresse angefordert werden: https://camunda.de/versicherung2019 \n\n__Über Camunda__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Plattform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Geschäftsprozessen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter https://camunda.com\n\n__Pressekontakt:__\n\nDeutschland:\nFlorian Bongartz\nflorian.bongartz@econ-news.de \n+49 176 20250099\n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\n\n","date":"2019-07-11","technicalName":"umfrage-versicherer-furchten-online-konkurrenz-am-meisten"},{"title":"Fintechs: 70 Prozent der Banken wollen Blase platzen sehen","text":"•\t69 Prozent der Banken wollen eigene Startups gründen\n•\tEigengründungen inzwischen genauso wichtig mit Fintechs zu kooperieren\n•\t67 Prozent der Bankmanager kritisieren fehlende Digitalstrategie\n\n__Berlin, 16. Juli 2019__ – Bei deutschen Fintechs rollt die Pleitewelle. Allein in den ersten zwei Quartalen 2019 haben fast drei Dutzend das Geschäft eingestellt. 70 Prozent der Banken in Deutschland sehnen das herbei. Sie wünschen sich, dass die „Fintech-Blase“ platzt, damit die Institute wieder mehr Geld verdienen. Dennoch betreiben 69 Prozent eigene Startups oder stehen kurz davor. Ebensoviele arbeiten mit digitalen Neustartern zusammen. Das geht aus einer Umfrage der Software-Firma [Camunda](https://camunda.com/ \"Camunda\") hervor.\n\nObwohl viele der digitalen Angreifer aggressiv auftreten, arbeiten Fintechs häufig auch mit den etablierten Banken zusammen. Einige Institute beteiligen sich sogar direkt an Startups oder rufen dazu auf, sich mit guten Ideen an die Bank zu wenden und im Gegenzug Geld und Know-how zu bekommen, damit daraus ein marktfähiges Produkt wird. So sollen digitale Neuerungen möglichst früh entdeckt und rechtzeitig in die eigenen Dienste eingebunden werden. Insgesamt sind die zehn größten Banken in Deutschland an mehreren Dutzend Fintechs beteiligt. „Wer mit Fintechs arbeitet oder eigene Startups gründet, kann digitale Angebote häufig schneller entwickeln als gewohnt“, sagt Jakob Freund, CEO von Camunda.\n\nViele Banken drohen sich dabei jedoch zu übernehmen, weil sie sich um zu viele Dinge gleichzeitig kümmern. 73 Prozent arbeiten beispielsweise an digitalen Helfern wie Banking Apps oder Finanz-Apps, damit die Kunden ihr Haushaltsbuch digital führen können. Zwei Drittel der Institute wollen sich zudem mit Partnern zusammentun, um ihre Angebote gemeinsam zu vertreiben. Das verwirrt zunehmend auch die Manager. Mehr als 60 Prozent kritisieren, dass die Vorstände keinen Plan für die Digitalisierung hätten. „Einige Banken tanzen auf zu vielen Hochzeiten. Sie sollten sich lieber auf ihre Kernkompetenzen besinnen und darin besonders gut sein“, so Jakob Freund.\n\nDer Camunda-Chef verweist auf Microsoft-Gründer Bill Gates, der noch heute bereue, bei mobilen Betriebssystemen das Feld Google und Android überlassen zu haben. Erst kürzlich sagte er, dass sei sein größter Fehler gewesen, weil der Suchmaschinengigant jetzt uneinholbar vorne liege. Damit den Banken nicht das gleiche Schicksal blüht, sollten die Institute ihre Software künftig selbst entwickeln und die wichtigsten Komponenten ihrer Kern-IT in der eigenen Hand halten. „Wenn der digitale Superdienst fertig ist, darf die Integration nicht an veralteter Kernbank-IT oder einer langwierigen Mehrjahresplanung scheitern“, mahnt Jakob Freund. „Banken und ihre IT-Abteilungen müssen neue Angebote in den Markt treiben können, ohne viel Zeit zu verlieren.“\n\n__Über die Umfrage__\n\nIm Mai 2019 hat Camunda 102 Führungskräfte und Projektleiter in Banken über die digitale Transformation befragt. Die Antworten wurden online gegeben. Die Ergebnisse können unter folgender Internetadresse angefordert werden: https://camunda.de/bank2019 \n\n__Über Camunda__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Plattform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Geschäftsprozessen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter https://camunda.com\n\n__Pressekontakt:__\n\nDeutschland:\nFlorian Bongartz\nflorian.bongartz@econ-news.de\n+49 176 20250099\n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\n","date":"2019-07-16","technicalName":"fintechs-70-prozent-der-banken-wollen-blase-platzen-sehen"},{"title":"Cloud Computing: Camunda veröffentlicht Cloud-Native Microservices Workflow-Engine Zeebe","text":"*Erstmals steht Unternehmen mit Zeebe eine horizontal skalierbare Workflow-Engine zur Verfügung, die sich nativ aus der Cloud betreiben lässt um Microservices zu steuern. Zeebe bietet bereits in der kostenfreien Community Edition die Möglichkeit, Geschäftsprozesse in verteilten IT-Architekturen darzustellen sowie eingesetzte Microservices und den laufenden Betrieb in Echtzeit zu überwachen.*\n \n__Berlin, 17. Juli 2019 -__ Camunda veröffentlicht die erste serienreife Workflow-Engine für Cloud-Architekturen. Zeebe arbeitet mit dem verbreiteten BPMN-Standard, um Workflows zu modellieren, grafisch darzustellen und auszuführen. Die Software kann Microservices in verteilten IT-Architekturen steuern und arbeitet dabei mit cloud-nativen Komponenten wie Kubernetes, Apache Kafka oder Elasticsearch zusammen. Zeebe benötigt keine eigenständige Datenbank und darf in der Community Edition kostenfrei heruntergeladen und genutzt werden. Das gab das Unternehmen heute in Berlin bekannt.\n \nCamunda ermöglicht mit Zeebee, Microservices in verteilten IT-Systemen automatisch steuern und ausführen zu lassen, selbst wenn dafür cloudbasierte Komponenten eingebunden werden müssen. Laut einer Camunda-Umfrage nutzen bereits 64 Prozent der Unternehmen weltweit Microservices für mehrere und in einigen Fällen für alle produktiven Anwendungen. 59 Prozent bemängeln dabei, dass viele ihrer Vorgänge nicht durchgängig digitalisiert sind (end-to-end). Ein Problem sind beispielsweise Medienbrüche, die dadurch entstehen, dass sich SaaS-Module aus der Cloud (Software as a Service) von gängigen Workflow-Engines kaum ansprechen lassen.\n \nZeebe nutzt dafür das sogenannte Event-Streaming, um cloud-basierte Architekturen horizontal zu skalieren. Die Workflow-Engine holt die von Cloud-Komponenten erzeugten Ereignisse ab und übergibt die damit verbundenen Aufgaben an einen Microservice. Software-Entwickler sind damit erstmals in der Lage:\n- Auf Microservices basierende Workflows für Anwendungen zu entwerfen, auszuführen und zu verwalten die in der Cloud unbegrenzt skalierbar sein müssen\n- Dienstübergreifende Workflows und alle ausgeführten Workflow-Instanzen über mehrere Microservices hinweg zu überwachen\n- Dienstübergreifende Workflows zu orchestrieren, damit alle Flows gemäß den geltenden SLAs (Service Level Agreements) abgeschlossen werden und sich Probleme, die manuell behoben werden müssen, schneller entdecken lassen\n- Ein historisches Audit-Protokoll zu nutzen, um Workflow-Daten später zu analysieren\n\n\nDie meisten Unternehmen haben mit Microservices gute Erfahrungen gemacht. Fast zwei Drittel geben an, dass sich die eingesetzten Anwendungen durch Microservices besser skalieren lassen als vorher. 60 Prozent können dadurch neue Produkte schneller auf den Markt bringen. “Wer schnell und flexibel das eigene Geschäft skalieren möchte, kommt an Microservices kaum noch vorbei”, sagt Daniel Meyer, CTO von Camunda. “Wir freuen uns, mit Zeebe jetzt eine serienreife Workflow-Engine anzubieten, die auch Prozesse automatisieren kann, die sich bisher wegen schlechter Skalierbarkeit oder architektonischer Anforderungen nur schwer oder gar nicht verarbeiten ließen.”\n \nDas bestätigt beispielsweise auch das Unternehmen Credit Sense. “Zeebe führt die verteilten Systeme an einer Stelle zusammen statt sie über den gesamten Programmcode zu verteilen”, sagt Jarred Filmer, Software Engineer bei Credit Sense. “Uns war wichtig, dass nicht nur Senior Engineers wissen, wie sich das System verhält, wenn wir etwas verändern. Weil Zeebe die modellierten Prozesse direkt ausführen kann, fällt uns auch die Kommunikation zwischen verschiedenen Abteilungen und dem Management leichter als bisher. Jeder, der zum Gelingen eines Projekts etwas beigetragen hat, kann jetzt ohne Probleme darüber sprechen.”\n \nZeebe gehört zum umfangreichen Technologie-Stack von Camunda. Camunda bietet Software-Entwicklern und Fachbereichen eine integrierte Plattform, die alle Phasen bei der Workflow-Automatisierung abdeckt, von der Prozessmodellierung und -ausführung bis hin zur kontinuierlichen Verbesserung der bestehenden Abläufe. Der Stack enthält Werkzeuge, die sich zur Modellierung und Ausführung von Geschäftsprozessen eignen. Visuelle Schnittstellen sorgen dafür, dass sich aktive Prozesse überwachen, Fehler beheben und große Datenmengen analysieren lassen.\n \n__Kostenloser Download__\n \n*Die Community Edition von Zeebe kann kostenfrei betrieben werden und steht ab sofort zum Download bereit unter https//zeebe.io.*\n \n__Weitere Informationen __\nMehr über Zeebee, Microservices und den Camunda-Technologiestack:\n\nhttps://zeebe.io/blog/2019/07/announcing-zeebe-0-20-production-ready/\n\n \n\n__Über Camunda__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\n\nMit seiner Open Source Plattform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Geschäftsprozessen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter https://camunda.com\n\n\n\n__Pressekontakt:__\n\n__Deutschland:__\n\nFlorian Bongartz\nflorian.bongartz@econ-news.de \n+49 176 20250099\n\n\n__USA & International:__\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com\n\ncamunda services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\n\n\n\n\n","date":"2019-07-17","technicalName":"camunda-releases-industrys-first-horizontally-scalable-cloud-native-workflow-engine-for-microservices"},{"title":"","text":"","date":"2019-08-08","technicalName":"wipro-partners-with-camunda-to-offer-workflow-automation-platform"},{"title":"Camunda eröffnet ausverkaufte CamundaCon 2019","text":"*Die Anwenderkonferenz der Softwarefirma Camunda zeigt Innovationen im Bereich der Workflow-Technologie, Fallstudien aus der Praxis und Best Practices für Geschäftsprozesse.*\n\n__Berlin, 12. September 2019__ – Die Berliner Softwarefirma [Camunda](https://camunda.com/) startet heute in Berlin die jährlich stattfindende Anwenderkonferenz [CamundaCon](https://www.camundacon.com/home). Mehr als 50 Referenten erläutern, wie sie in Unternehmen wie LinkedIn, AXA, Lufthansa, Roche, der australischen Post oder der Deutschen Telekom die Workflow-Automation-Software von Camunda einsetzen. Unter dem Hashtag #camundacon können Interessierte die Veranstaltung in den sozialen Medien mitverfolgen.\n\nDie diesjährigen Keynotes halten Jakob Freund, CEO und Mitgründer von Camunda, sowie CTO Daniel Meyer. Sie stellen die kommenden Trends und wichtige Innovationen in der Workflow-Automatisierung vor. Weitere Hauptredner sind die renommierte BPMN-Autorin, Analystin und Expertin Sandy Kemsley sowie die Technologen Susanne Kaiser und Bernd Rücker, einer der Mitgründer von Camunda. In ihren Vorträgen befassen sie sich mit Microservices-Umgebungen und erläutern, wie sich Best Practices in dieser sich schnell weiterentwickelnden IT-Architektur umsetzen lassen.\n\nDie CamundaCon richtet sich an Softwareentwickler, Facharchitekten und IT-Führungskräfte, die sich über Workflow- und Entscheidungsautomatisierung informieren möchten. Die Veranstaltung findet vom 12. bis 13. September 2019 in Berlin statt. Erstmals hat Camunda in diesem Jahr einen Track speziell für Entwickler geschaffen, mit Tutorials und Workshops, die von Camunda-Experten geleitet werden und Praktiker der Workflow-Automatisierung ansprechen.\n\n„CamundaCon bringt die besten Experten für Workflow-Automatisierung und BPMN mit unserer weltweiten Community und dem Entwicklerteam von Camunda zusammen“, sagt Gottfried Sehringer, Chief Marketing Officer bei Camunda. „Wir freuen uns sehr, dass so viele erfahrene Camunda-Anwender aus der ganzen Welt nach Berlin kommen, um ihre Fachkenntnisse und Best Practices untereinander auszutauschen, Fallstudien zum Geschäftsprozessmanagement vorzustellen und die neuesten Fortschritte im Bereich Workflow- und Decision Automation zu diskutieren.\"\n\nBleiben Sie mit dem Social-Media-Hashtag #camundacon über die CamundaCon auf dem Laufenden und lesen Sie die neusten Nachrichten auf unserem Blog: [https://blog.camunda.com/](https://blog.camunda.com/) \n\n__Über Camunda__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Plattform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Geschäftsprozessen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter https://camunda.com\n\n__Pressekontakt:__\n\nDeutschland:\nFlorian Bongartz\npresse@camunda.com\n+49 176 20250099 \n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\n\n","date":"2019-09-12","technicalName":"camunda-opens-sold-out-camundacon-2019"},{"title":"Camunda Cloud: Workflow-Automatisierung speziell für die Cloud","text":"__•\tCamunda Cloud bietet vollständigen Workflow-Technologie-Stack\n•\tHorizontal-skalierbare cloud-native Workflow-Engine enthalten\n•\tOn-Demand-Service nutzt BPMN als Modellierungssprache für Prozesse__\n\n__Berlin, 12. September 2019__ – Software-Entwickler haben es künftig leichter, wenn es darum geht, etablierte Cloud-Tools für die Workflow-Automatisierung zu verwenden. Dafür bietet die Berliner Software-Firma [Camunda](https://camunda.com/) jetzt einen cloud-nativen Workflow-Technologie-Stack an, der Geschäftsabläufe modellieren, automatisieren und verwalten kann. Entwickler sparen mit der [Camunda Cloud](http://camunda.com/cloud) viel Zeit, weil sie verteilte Systeme aufbauen können, die weniger komplex sind als bislang. Das gab das Unternehmen heute auf seiner jährlichen Anwenderkonferenz [CamundaCon](https://www.camundacon.com/) bekannt.\n\nErstmals steht Entwicklern mit der Camunda Cloud ein speziell für die Cloud entwickelter On-Demand-Service für Workflow-Automatisierung zur Verfügung, der BPMN nutzt und in BPMN modellierte Prozesse automatisch ausführen kann. Zum Technologie-Stack des neuen Angebots gehören die kürzlich ebenfalls für die Cloud veröffentlichte Workflow-Engine [Zeebe](https://zeebe.io/), das für die Prozessüberwachung entwickelte Modul Operate sowie das Modellierungs-Tool Cawemo, das ermöglicht, Abläufe kollaborativ zu erstellen.\n\n„Cloud-Anwendungen, die Betriebsprozesse automatisieren, haben sich bislang nur schwer skalieren lassen, weil die benötigten Workflow-Systeme dafür nicht ausgelegt waren“, sagt Jakob Freund, CEO und Mitgründer von Camunda. „Wir haben Camunda Cloud deshalb als cloud-native Workflow-Plattform entwickelt, damit sich die Entwicklerteams mehr auf Geschäfts- und Kundenanforderungen konzentrieren können und sich gleichzeitig auf eine Workflow-Technologie verlassen können, die sich nahtlos in ihre Cloud-Technologie einfügt.“\n\nDie Berliner reagieren damit auch auf den Trend, dass immer mehr Unternehmen selbst kritische Software-Anwendungen in die Cloud verlagern. Damit Anwendungsprozesse in der Cloud skalierbar automatisiert werden können, mussten Workflows bisher hart eincodiert werden. Dadurch wurden die IT-Systeme immer komplexer und schwerer zu verwalten. Zudem waren die Entwickler gezwungen, eigenes Know-how für die Cloud aufbauen und dafür Zeit investieren, die für ihre Kernaufgaben verloren ging. Camunda Cloud bietet den Entwicklerteams jetzt einen Workflow-Technologie-Stack, der diese Probleme von vornherein löst.\n\n__Drei Gründe für Camunda Cloud__\n\n•\tSpeziell für die Cloud entwickelt: Die neue Lösung von Camunda bietet einen sofort einsatzbereiten Werkzeugkasten für die Workflow-Automatisierung in der Cloud sowie eine stufenlos skalierbare Infrastruktur, die sich nahtlos in bestehende Cloud-Komponenten integrieren lässt.\n\n•\tMehr Flexibilität: Entwicklerteams können sich auf die angebotenen Services in einer leistungsfähigen Cloud-Umgebung verlassen, um ihre Workflows zu modellieren und auszuführen.\n\n•\tSchnellere Ergebnisse: Weil Entwickler weiterhin ihre gewohnten Cloud-Tools verwenden können, geht vor allem in verteilten Systemen weniger Zeit dadurch verloren, Insellösungen für die immer komplexere Einbindung von Cloud-Diensten zu suchen.\n\n__Camunda Cloud besteht aus den folgenden Komponenten:__ \n\n•\tOn-Demand Managed Cloud-Plattform: Cloud-Spezialisten von Camunda verwalten die Plattform, sorgen für eine stabile Umgebung und bieten technischen Support. \n\n•\tHorizontal-skalierbare und fehlertolerante Workflow Engine: Die neue Lösung kommt mit der horizontal-skalierbaren cloud-nativen BPMN-Workflow-Engine [Zeebe](https://camunda.com/about/press/camunda-releases-industrys-first-horizontally-scalable-cloud-native-workflow-engine-for-microservices/), mit der sich auch umfangreiche Workflows orchestrieren lasen, die bisher durch keine Workflow Engine verarbeitet werden konnten.\n\n•\tLeistungsstarke Tools zur Überwachung und Problemlösung: Camunda Cloud bietet ein visuelles Dashboard für Workflows, das speziell entwickelt worden ist, um technischen Anwendern die Überwachung und Verwaltung laufender Workflow-Instanzen zu erleichtern. \n\n•\tKollaborative Online-Designumgebung für Prozesse: Mit dem neuen Service von Camunda können Business- und IT-Teams noch einfacher zusammenarbeiten, um gemeinsam an Geschäftsprozessen zu arbeiten und diese später zu automatisieren.\n\nVerfügbarkeit\n\nCamunda Cloud ist derzeit als Beta-Version über eine Early-Access-Programm verfügbar, zu dem interessierte Entwickler einen Zugang anfordern können unter [https://camunda.com/cloud](https://camunda.com/cloud). \n\nTeilnehmer auf der CamundaCon 2019 erhalten eine Live-Demo und bekommen den Beta-Zugang direkt am Camunda-Stand „Ask me Anything“. Mehr Informationen:\n\nCamunda Cloud-Produkte: [https://camunda.com/cloud](https://camunda.com/cloud) \nCamunda-Blog: [https://blog.camunda.com](https://blog.camunda.com) \nZeebe Cloud-native Workflow-Engine: [https://zeebe.io](https://zeebe.io) \n\n__Über Camunda__\n\nCamunda ist ein Softwarehersteller, der Prozessautomatisierung neu erfindet. Zahlreiche Organisationen, darunter Deutsche Bahn, Deutsche Telekom und Zalando vertrauen auf Camunda, um ihre Kernprozesse im Zuge der digitalen Transformation zu automatisieren.\nMit seiner Open Source Plattform für Workflow und Decision Automation bringt Camunda Transparenz ins Tagesgeschäft und steigert die Performance, Zuverlässigkeit und Skalierbarkeit von Geschäftsprozessen, die über verteilte Systeme hinweg in hoher Frequenz ausgeführt werden. Von Deloitte mehrfach als eines der am schnellsten wachsenden IT-Unternehmen Deutschlands und Europas ausgezeichnet, ist Camunda mit seinem Hauptstandort in Berlin sowie mit Büros in San Francisco und Denver, USA, vertreten. Mehr Informationen unter https://camunda.com\n\n__Pressekontakt:__\n\nDeutschland:\npresse@camunda.com\n\nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com \n\n__Absender:__\n\nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\n\n","date":"2019-09-12","technicalName":"camunda-announces-camunda-cloud-workflow-engineered-for-the-cloud"},{"title":"","text":"","date":"2019-09-13","technicalName":"updated-fourth-edition-of-real-life-bpmn-by-camunda-co-founders-released"},{"title":"","text":"","date":"2019-12-03","technicalName":"camunda-launches-new-release-of-open-source-platform-to-accelerate-business-process-automation"},{"title":"","text":"","date":"2020-02-26","technicalName":"camunda-announces-speaker-lineup-for-camundacon-new-york"},{"title":"Digitalisierung: Deutsche Telekom setzt auf Camunda zur Prozessautomatisierung und RPA Orchestrierung","text":"- Die Deutsche Telekom treibt die Digitalisierung des Unternehmens voran und nutzt Camunda unter anderem zur Automatisierung ihrer Prozesse im Customer Service Bereich\n\n- Eine der größten RPA-Landschaften Europas wird damit koordiniert und schrittweise von Frontend-Automatisierung auf Backend-Automatisierung umgestellt\n\n- Prozesse können dadurch schneller automatisiert, einfacher angepasst und höher skaliert werden\n \n__Berlin, 17. März 2020__ – Der Open-Source-Softwareanbieter Camunda unterstützt mit seiner erfolgreichen Process Automation Plattform die Deutschen Telekom im Customer-Service-Bereich. Dort wird Prozessautomatisierung auf breiter Front eingesetzt, um die Digitalisierung des Unternehmens voranzutreiben und ineffiziente Prozesse zu ersetzen. Camunda unterstützt die Koordination von über 2.500 individuellen Software-Robotern, die Überführung der aktuellen Frontend-Automatisierung zu einer weniger pflegeintensiven und besser integrierten Backend-Automatisierung und ermöglicht die Realisierung von weiteren Automatisierungs- und Einsparpotenzialen.\n \nDie Telekom will den Kundendienst digital besser unterstützen und Prozesse weiter verbessern und automatisieren. Dabei ist das Unternehmen so gut wie bisher kaum ein anderes Unternehmen in Europa vorangekommen und hat ein Heer von über 2.500 Software-Robotern (RPA-Bots) aufgebaut, um damit einzelne manuelle Abläufe automatisch abzuwickeln und zu verbessern. Hiermit werden jährliche Einsparungen von rund 100 Mio. Euro erzielt. Im nächsten Schritt geht es nun für die Telekom darum, diese Technologie der Frontend-Automatisierung, welche relativ hohe Aufwände bei der Wartung, Fehlerbehandlung und End-to-End-Steuerung der Geschäftsprozesse verursacht, in eine Backend-Automatisierung umzuwandeln und stärker mit den Backends der Core IT-Systeme zu integrieren. Jetzt sorgt mit Camunda BPM eine zentrale Plattform für Prozessautomatisierung dafür, dass die beteiligten IT-Systeme und RPA-Bots direkt über Schnittstellen angesprochen und von Anfang bis Ende alle benötigten Informationen digital ausgetauscht werden können. Im nächsten Schritt werden diese RPA-Bots zunehmend durch API-basierte Schnittstellen ersetzt, ohne dass die Prozesse in Camunda angepasst werden müssen. Auf diese Weise wird eine sanfte Migration hin zu einer IT-Infrastruktur ermöglicht, die eine nachhaltige digitale Transformation ermöglicht. \n\n„Wir sind stolz darauf, sehr früh digitalisiert und eine der größten RPA-Plattformen Europas aufgebaut zu haben“, sagt Marco Einacker, Vice President Service IT bei der Telekom. „Wir treten nun in die nächste Phase ein, in der wir auf unserer RPA-Erfahrung aufsetzen und Prozesse mit Hilfe von Camunda von Anfang bis Ende automatisieren, um die digitale Transformation schnell und nachhaltig voranzutreiben.“\n\n„Automatisierte Prozesse sind der Kern eines jeden digitalen Unternehmens.“, sagt Jakob Freund, CEO von Camunda. „Zu diesem Zweck müssen Business und IT effektiv kollaborieren und Prozesse über unterschiedlichste technische Systeme hinweg durchgehend gesteuert werden. RPA ist für viele Unternehmen eine sinnvolle kurzfristige Lösung, um die Arbeit in Altsystemen punktuell zu automatisieren. Im nächsten Schritt müssen diese isolierten RPA-Bots in eine durchgehende Prozess-Steuerung einbezogen und, soweit möglich, nach und nach durch echte API-Services ersetzt werden. Wir freuen uns, die Deutsche Telekom mit Camunda BPM auf ihrem Weg zum digitalen Unternehmen begleiten zu dürfen.\n \nMit der Camunda BPM Software können komplette Prozesse und komplexe Entscheidungen modelliert, automatisiert und verbessert werden. Das erleichtert Unternehmen, auch umfangreichere Abläufe über mehrere IT-Systeme hinweg automatisch und damit deutlich schneller und kostengünstiger als bislang abzuarbeiten. Camunda setzt hierbei auf die etablierten Standards BPMN und DMN, die eine effektive Verständigung zwischen Fachverantwortlichen und Softwareentwicklern ermöglichen. Dank der End-to-End-Steuerung der Prozesse in Camunda existiert ein vollständiger Überblick inklusive der involvierten RPA-Bots. Dieser dient nicht nur der Überwachung einzelner Vorgänge, sondern ist insbesondere für die Verbesserung der generellen Leistungsfähigkeit der Prozesse wichtig, die sich in Key Performance Indicators (KPI) darstellen lässt.\n\nDie neue Lösung mit Camunda BPM wurde in 2019 innerhalb der Deutschen Telekom eingeführt und befindet sich seit Anfang 2020 im Produktivbetrieb.\n \nÜber Camunda\nCamunda revolutioniert die Prozessautomatisierung mit einer Open Source Plattform, die auf offenen Standards basiert, hoch skalierbar ist und die Zusammenarbeit zwischen Softwareentwicklern und Fachanwendern optimal unterstützt. \n\nTausende von Usern, darunter Unternehmen wie Allianz, ING Bank oder die Lufthansa Technik modellieren, automatisieren und verbessern ihre Kernprozesse mit Camunda ganzheitlich und über Systemgrenzen hinweg. Unsere Workflow und Decision Automation Tools erlauben es ihnen Software-Anwendungen schneller, kollaborativer und kosteneffizienter zu realisieren und die Flexibilität, Transparenz und Skalierbarkeit zu erreichen, die für die digitale Transformation unabdingbar sind. Mehr Informationen unter [https://camunda.com/ ](https://camunda.com/) \n \n \nPressekontakt:\n \nDeutschland:\npresse@camunda.com\n \nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com\nJill Reed, Sift Communications, Jill.Reed@siftpr.com\n \nAbsender:\n \nCamunda Services GmbH\nZossener Straße 55-58\n10961 Berlin\nAmtsgericht Charlottenburg: HRB 113230 B\nUSt.-IdNr. DE 259 411 084\nGeschäftsführer: Jakob Freund, Bernd Rücker\nhttps://camunda.com\n\n","date":"2020-03-17","technicalName":"digital-transformation-deutsche-telekom-counts-on-camunda-for-process-automation-and-rpa-orchestration"},{"title":"","text":"","date":"2020-03-24","technicalName":"camunda-unveils-its-global-online-conference-camundacon-live"},{"title":"","text":"","date":"2020-04-07","technicalName":"camunda-launches-optimize-3-0-for-process-events-monitoring-across-systems"}],"en":[{"title":"Camunda 7.3 was released on May 31st","text":"Berlin – Software vendor Camunda has released version 7.3 of its open source process automation platform on 31st May. The product can be downloaded free of charge at www.camunda.org.\n\nThis new version allows the status change of ongoing processes so that process instances can be transferred “on-the-fly” to another state. Linked to this is a flexible way to grant authorizations, so that for example the members of certain user groups are the only ones able to see, start or change certain business processes. The third major new feature is the plug-in architecture of the included task list which enables employees to process the tasks assigned to them.  The new architecture allows to flexibly adapt and expand the task list‘s functions.\n\nAccording to the vendor, the new version has been particularly influenced by requests made by customers such as T-Mobile Austria, since Camunda is now used in many large companies for mission-critical core processes.\n\nAbout Camunda Services GmbH:\n\nCamunda Services GmbH, headquartered in Berlin, Germany, is a software vendor and consultancy specializing in Business Process Management (BPM).  The company’s core product, Camunda BPM, is an open source platform for the automation of business processes. Camunda’s customers include Generali Insurances, Lufthansa Technik and Zalando.\n\nPress contact:\n\nFor further information please contact:\nNastasja Johnston\nTel.: 030 664 04 09 00\nEmail: Nastasja.Johnston@camunda.com \n","date":"2015-06-01","technicalName":"camunda-7-3-was-released-on-may-31st"},{"title":"Michael Ferber übernimmt Bereichsleitung bei Camunda","text":"","date":"2015-10-02","technicalName":"michael-ferber-ubernimmt-bereichsleitung-bei-camunda"},{"title":"Camunda BPM 7.4 has been released on November 30th ","text":"<strong>Berlin, Germany</strong>– On November 30th, Camunda has released Camunda BPM 7.4, a new version of an open source software for Business Process Management (BPM). Camunda BPM 7.4 can be downloaded for free at www.camunda.org. \n\nCamunda BPM 7.4 supports the standard „Decision Model and Notation (DMN)“, that has been released earlier in 2015 by Object Management Group (OMG) – the same institution that is also responsible for the established BPMN standard. DMN allows to define and automate decision tables. This means that business users can create and maintain their business rules more independently from software developers.  \n\nCamunda BPM 7.4 comes with a DMN-conformant table editor, a technical engine for executing DMN tables and a web application that allows to review executed decisions and change decision tables on the fly. Since Camunda BPM also supports the standards BPMN (for workflow automation) and CMMN (for case management), this promises a more holistic approach for automating business processes. \nBesides this, the new Camunda Modeler is an open source tool for creating BPMN diagrams. It is based on the well-known project bpmn.io and targets business users as well as software developers. \n\nCamunda’s CEO Jakob Freund comments: „Camunda is once again the driver for innovation in the BPM market. Our core product is open source, and at the same time we are a profitable business with 40 employees, without any external funding. Among our customers are well-known names such as AT&T, Allianz Indonesia, T-Mobile and Zalando. I think we have already achieved a lot, but this is just the beginning.”\n\nAbout Camunda Services GmbH:\n\nCamunda Services GmbH, headquartered in Berlin, Germany, is a software vendor and consultancy specializing in Business Process Management (BPM).  The company’s core product, Camunda BPM, is an open source platform for the automation of business processes. \n\nPress contact:\n\nFor further information please contact:\nJakob Freund\nTel.: +49 30 664 04 09 00\nEmail: Jakob.Freund@camunda.com \n","date":"2015-11-30","technicalName":"camunda-bpm-7-4-has-been-released-on-november-30th"},{"title":"Camunda starts Beta Test for DMN in the Cloud","text":"Today, the software vendor Camunda has announced a public beta test of their new DMN-related cloud offering. It is available at https://dmn.camunda.cloud and free to use.\n\nDMN (\"Decision Model and Notation\") is an IT industry standard for decision management. It allows business users to get involved in the technical implementation of business rules and even change them independently from rigid software development cycles.\n\nCamunda's idea is to let any developer benefit from DMN without necessarily embedding and operating their DMN engine. Developers can create and test DMN decision tables directly in the web browser. They can deploy those tables to the Camunda server with one click, and then call and execute them from their own application via the REST API. The execution result will be sent back to the client application for further processing. On Camunda's website, there are several code examples for different programming languages such as Java, Javascript, C# or PHP.\nCamunda's CEO Jakob Freund explains: \"We have made this service as simple as possible, since we want all developers out there to benefit from DMN with minimal efforts.\"\n\nDuring the beta test stage the new service is free to use. However, Camunda gives no guarantees regarding availability, correctness and data protection. Currently, there is no date for general availability of Camunda's new service, as Jakob Freund explains: \"We want to learn how the community adpots our offering, and based on that we will decide upon the next steps.\"\n\nAbout Camunda:\nCamunda headquartered in Berlin, Germany, is a software vendor and consultancy specializing in Business Process Management (BPM).  The company’s core product, Camunda BPM, is an open source platform for the automation of business processes. It is being used by companies such as AT&T, Lufthansa Technik and Zalando.\n","date":"2016-03-21","technicalName":"camunda-starts-beta-test-for-dmn-in-the-cloud"},{"title":"Berlin software vendor awarded most innovative solution for Business Process Management","text":"Santa Barbara, CA | April 24, 2017 - Berlin-based software vendor Camunda has won the bpmNEXT “Best in Show” award for the second year in a row.\n \nThe annual event in Santa Barbara, California is the world’s most important conference for BPM software vendors to showcase their latest innovations. Camunda was recognized for its new workflow automation technology. Conference attendees were impressed by the ability of the new technology to execute workflows at a throughput 200 times higher than that of existing technologies.\n\n“The advancement in digitalization leads to a massive increase in complex technical transactions,\" says Jakob Freund, Camunda CEO, explaining the motivation behind the project. “Traditional workflow technologies are limited in performance and scalability and new paradigms such as Microservices and NoSQL databases are less compatible with traditional workflow technologies, a problem our new product addresses.”\n \nCamunda was presented with the coveted bpmNEXT “Best in Show” award as a result of audience votes, a confirmation for Freund for the need of this new technology. “In Santa Barbara we have witnessed the BPM industry recognize the relevance of the problem at hand and our approach to fixing it. Naturally we are also proud to be the only software vendor to have won this award for a second time in a row.”\n\nCamunda is currently testing the new technology internally with different data and a few customers in beta mode. The finished product will be deployed as an open source project in the coming months.\n\n\nAbout Camunda:\nCamunda is a Berlin based software company specialized in BPM (Business Process Management). The company's core product, Camunda BPM is an open source platform for the automation of business processes. Some of Camunda’s customers include Deutsche Bahn, Lufthansa Technik and Zalando. In 2016 Camunda’s revenue grew 82% and Camunda currently employs 70 people in their headquarters in Berlin and offices in San Francisco and Denver, USA.\n\nFor more information please contact:\nDarya Niknamian, Content Marketing Manager \nE-mail: Darya.Niknamian@camunda.com\n\nCamunda Inc. \n275 Battery St, Suite 2600\nSan Francisco, CA 94111 USA\nPhone +1.415.800.3908\n\nCamunda Services GmbH\nZossener Str. 55 - 10961 Berlin, Germany\nPhone +49 30 664 04 09 - 00\n","date":"2017-04-24","technicalName":"berlin-software-vendor-awarded-most-innovative-solution-for-business-process-management"},{"title":"Camunda offers a new solution for process improvement","text":"The Berlin based software company Camunda launched a new tool for process improvement. \n\nCawemo (www.cawemo.com) is a SaaS product for the collaborative design of process models. It supports the ISO-standard BPMN and focuses on usability, while also creating an optimal environment for teams to collaborate. \n\nJakob Freund, CEO of Camunda says “tools like Trello and Slack have started a new era of enterprise-apps. Now it’s our turn to introduce business process apps into this space. Whoever carries out a process, knows best how to improve it and with Cawemo everyone will have the chance to improve their own processes. The age of centralized process organization is a thing of the past.”\n\nThis vision also becomes clearer when looking at Cawemos’ price model: Teams with up to three members are free of charge. A charge of only 12 USD per user per month is due with the addition of the fourth user. In comparison to similar tools on the market, this price point is very affordable.\n \n“Our price model makes it even possible for smaller teams with little to no budget to design, communicate and improve their own processes” says Freund. Camunda wants to allow every project manager or team lead to use Cawemo without having to worry about time-consuming approval and purchasing processes.\n\nCawemo advertises the following features:\n•\tDesigning process models in the cloud, providing unlimited accessibility, \n•\tCollaboration of team-members in real time and with the ability to edit and comment on process models, \n•\tImprove real life processes and workflows within the whole company by sharing the models easily and embedding them in knowledge management tools like Confluence. As soon as a model is edited in Cawemo, all shared and embedded versions of it are updated automatically. \n\nAbout Camunda: \nCamunda is a Berlin based software company specialized in BPM (Business Process Management). The company's core product, Camunda BPM is an open source platform for the automation of business processes. Some of Camunda’s customers include Deutsche Bahn, Lufthansa Technik and Zalando. In 2016 Camunda’s revenue grew 82% and Camunda currently employs 70 people in their headquarters in Berlin and offices in San Francisco and Denver, USA. \n\nAbout Trello: \nTrello is a web-based project management software operated by the Australian company Atlassian.\n\nAbout Slack: \nSlack is a web-based instant-messaging app for the communication within teams created by the us-american company Slack Technologies. \n\nAbout Confluence:\nConfluence is a commercial Wiki-Software developed by the Australian company Atlassian. \n","date":"2017-05-02","technicalName":"camunda-offers-a-new-solution-for-process-improvement"},{"title":"Energy Giant chooses Camunda BPM to kindle Digital Transformation ","text":"Berlin, Germany | May 30, 2017 - Lampiris, Belgium’s third largest supplier of gas, green power and energy chooses Camunda BPM to serve the Belgian market and expansion into France.\n \nLast year TOTAL, the fourth largest international oil and gas company with operations in more than 130 countries acquired Lampiris. This acquisition impacted the magnitude of Lampiris’ customer base, accelerating their digital transformation.\n\nLampiris has not been a stranger to Business Process Management (BPM), using open source software in the past before choosing Camunda. David Wery, Team Lead at Lampiris says, “we’ve developed our projects based on open source software and have created our own state machine. With our acquisition we knew we had to update future processes but didn’t want to reinvent the wheel. Camunda’s tools and philosophy proved to be the perfect solution. The support of their consultants especially helps us review and re-adjust our processes and reach a professional level with orchestration.”\n \nLampiris uses Camunda BPM for two core projects - first with the expansion into France to operationally manage the growth of new clients from lead (i.e. attracting new customers) to delivery (i.e. providing energy to these customers). These operations involve hundreds of internal staff and impact hundreds of thousands of inhabitants in France looking for a new service provider.\n \nSecondly, Lampiris is also optimizing its processes for when clients move and captures new clients who move into the home - it is essential to continue support when a client moves but it becomes a challenge when the process is administratively heavy. “With Camunda we know that all steps are visible and properly managed. When a client speaks to our customer service agents, they know at which stage they are in terms of their energy supply and this helps us avoid churn” says Wery.\n \nLampiris are preparing for their continued expansion and will digitalize all their processes to allow for mass market adoption of their services. Camunda BPM plays a core role in supporting the efficiency and speed required to spark this transition.\n \n\nAbout Lampiris\nLampiris, an independent supplier of gas, green power and energy services such as insulation, furnace maintenance, wood and pellets for heating, and smart thermostats, has been active in the Belgian energy market since 2005. Lampiris, which currently supplies more than a million accounts, is the third-largest supplier in the residential energy market in Belgium. lampiris.be\n \nAbout Camunda\nCamunda is a Berlin based software company specialized in BPM (Business Process Management). The company's core product, Camunda BPM is an open source platform for the automation of business processes. Some of Camunda’s customers include Deutsche Bahn, Lufthansa Technik and Zalando. In 2016 Camunda’s revenue grew 82% and Camunda currently employs 70 people in their headquarters in Berlin and offices in San Francisco and Denver, USA.\n\nFor more information, please contact:\nDarya Niknamian, Content Marketing Manager\nEmail: Darya.Niknamian@camunda.com ","date":"2017-05-30","technicalName":"energy-giant-chooses-camunda-bpm-to-kindle-digital-transformation"},{"title":"Camunda launches Zeebe, a new Open Source Project for Microservice Orchestration","text":"Berlin, Germany | August 10, 2017 - Camunda, the Business Process Management (BPM) software company launches Zeebe, a new open source project for microservice orchestration. Zeebe allows users to define orchestration flows visually using BPMN, the popular standard for Business Process Modeling. Zeebe ensures that once started, flows are always carried out fully, retrying steps in case of failures. Along the way, Zeebe maintains a complete audit log so that the progress of flows can be monitored and tracked. Zeebe is a big data system and scales seamlessly with growing transaction volumes.\n\nJakob Freund, CEO of Camunda, says, “Digital transformation increasingly puts pressure on companies to innovate and scale their engineering efforts. Microservice architecture, the decomposition of large monolithic systems into smaller, more manageable pieces allows companies to achieve the necessary agility. Yet it remains a challenge to reliably and consistently execute mission critical transactions across these distributed systems and ensure visibility into processes. We have created Zeebe to enable businesses to leverage the benefits of microservices while staying in control of their operations.”\n\nInternally, Zeebe is a fully distributed system leveraging event-sourcing, append-only persistence and replication. “Zeebe is a core innovation in Workflow Engine Architecture. When we started Zeebe we knew that we had to start from scratch and re-invent how an engine works to fulfill extreme requirements of scalability and fault-tolerance” says Daniel Meyer, VP Engineering.\n \nZeebe can be used in combination with different programming languages. Clients for Java and Go are being developed as a priority with more to follow soon.\n\nA production-ready release of Zeebe is targeted for the beginning of 2018. For more information about Zeebe’s capabilities and features, please visit https://zeebe.io.\n \n\nAbout Camunda\nCamunda is a Berlin based software company specialized in BPM (Business Process Management). Some of Camunda’s customers include Deutsche Bahn, Lufthansa Technik and Zalando. In 2016 Camunda’s revenue grew by 82%. Camunda currently employs 70 people in their headquarters in Berlin and offices in San Francisco and Denver, USA.\n\nFor more information, please contact:\nDarya Niknamian, Content Marketing Manager\nE-mail: Darya.Niknamian@camunda.com","date":"2017-08-10","technicalName":"camunda-launches-zeebe-a-new-open-source-project-for-microservice-orchestration"},{"title":"Camunda Releases First Application Combining Big Data and Workflow Automation to Provide Immediate Insight into Revenue-Generating Business Processes","text":"Optimize 2.0 Delivers Continuous Visibility into Business Process Performance Across an Organization, Guidance for Identifying and Fixing Weak Spots in Core Processes.\n\nBERLIN and SAN FRANCISCO, April 5, 2018  –  Camunda , a software company reinventing workflow automation, today announced the general availability of Camunda Optimize 2.0, the first application of its kind that combines big data and workflow automation to provide a holistic view of business process performance across an organization. The new product provides business stakeholders with instantaneous insight into revenue-generating business processes as they are automated in Camunda. With Optimize 2.0, business leaders can identify potential problems and fix weak spots in core processes before delivery of products and services to customers is disrupted. Optimize 2.0 is part of Camunda Enterprise and a free trial version is available for download today at https://camunda.com/download/enterprise/.\n\n“At Talanx, as the volume of processes we automate in Camunda keeps growing, it has become clear that having an end-to-end view showing the overall connectivity of these processes and the complete lifecycle is the key to obtaining a deeper understanding of our business operations,” said Uwe Koch, IT enterprise architect at Talanx, a major European insurance group based in Hannover, Germany, and active in more than 150 countries. “The visualization Camunda offers with Optimize 2.0 is quite compelling. We see many advantages in the way Optimize combines dashboards with the BPMN representation of the process to provide very intuitive access to the business data.”\n\nThe workflow automation market is expected to reach nearly $17 billion by 2023, up from $4.7 billion in 2017 [1]. As companies across industries accelerate their digital transformation initiatives and bring more business functions online, IT systems are becoming increasingly distributed. With this shift, business processes are undergoing their own transformation and becoming more complex and interconnected, driving demand for modern workflow automation and visibility technology designed for the digital enterprise. Business leaders need actionable insight into how core processes are performing across these new distributed systems and what impact digital transformation projects are having on their ability to serve their customers.\n\nMany traditional workflow systems can’t manage this dramatic increase of transactions processed online, in addition to the growth of distributed systems as companies adopt cloud, containers and microservices. Camunda is the only vendor addressing the “big workflow” impact all these developments have with solutions that provide cohesive, end-to-end intelligence into how well core business workflow processes are working.\n\n“Optimize 2.0 combines the power of big data and workflow automation to enable customers to understand what’s going on with the most important aspects of their business: their revenue-generating processes,” said Jakob Freund, co-founder and CEO of Camunda. “With its powerful flow charts, reports and analytics, Optimize customers can see precisely what steps have been executed, the status of orders for customers and detailed information if and why they are stuck in the process. With this new product, Camunda is fulfilling its mission to complete the cycle of continuous process improvement.“\n  \nKey Highlights\nOptimize 2.0 provides a report builder, dashboards, alerts and correlation analytics to give Camunda customers unprecedented visibility into how their business workflows and processes are performing. With the Camunda REST API, Optimize imports the historical data, storing it in an Elasticsearch big data repository that allows for powerful queries. After the initial import, Optimize will pull new data from Camunda in configurable intervals providing you with up-to-date information in soft real-time. The data import itself can be customized, which allows you to enrich the data in Optimize with information that you can pull from any source available to you.\n\n● Data Visualization  – Create and share beautiful reports, dashboards and heatmaps for business monitoring to understand how process steps are performing, where bottleneck exist and the root causes for low performance. Drill down into the number of process instances grouped by days or the average duration of process instances by hour. Reports and dashboards can be embedded in other applications like Atlassian Confluence to provide up-to-the-minute information to stakeholders, and report data can be exported to CSV files for access in tools like Microsoft Excel.\n\n● Alerting  – Configure alerts for immediate notification when performance goals are missed. If stakeholders need to be informed immediately once certain thresholds are reached, alerts can be set up to trigger based on specific variables that have been defined, including which recipients should be alerted, when and how (email or text) and at what frequency.\n\n● Advanced Analytics  – Leverage powerful analytics to understand how certain variants in processes impact business results, using branch analysis and data correlation features. Process variants are often expressed as explicit branches in the processes that are merged again at a later point. Optimize helps determine the impact of certain variants on the process outcome. For example, an e-commerce provider could determine if an additional approval step might lead to an increase in order cancellations.\n\nTo learn more about Optimize 2.0 and to view how it works, Camunda is hosting a webinar on April 11, from 8:00 a.m. to 9:00 a.m. PDT. Please register to attend, or to access it on demand, at : https://register.gotowebinar.com/register/1924243594699537665\n\nAvailability\nOptimize 2.0 is part of Camunda Enterprise and a free trial version is available for download today at https://camunda.com/download/enterprise/.\n\nCamunda for the Enterprise\nThe  Camunda Enterprise Platform  is based on the company’s popular open source workflow and decision automation platform and includes additional features, guarantees and services to enable accelerated development of workflow solutions and rock-solid production deployments.\n\nThe Enterprise Platform features an advanced version of Cockpit for operating production deployments of BPMN workflows and DMN decisions, and includes Optimize 2.0 for rich data visualization, flexible alerting and advanced analytics. Camunda Enterprise users also receive SLA-based support and maintenance, contractual warranties, ongoing maintenance, and training and consulting services.\n\n\nAbout Camunda\nCamunda  is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit:  https://camunda.com/\n\nMedia Contact:\nJill Reed, Sift Communications, jill.reed@siftpr.com\n\n\n[1] Market Research Nest, “2018-2023 Global and Regional Workflow Automation Industry Production, Sales and Consumption Status and Prospects Professional Market Research Report”\n\n","date":"2018-04-05","technicalName":"camunda-releases-first-application-combining-big-data-and-workflow-automation-to-provide-immediate-insight-into-revenue-generating-business-processes"},{"title":"New Research Shows 63 Percent of Enterprises Are Adopting Microservices Architectures Yet 50 Percent Are Unaware of the Impact on Revenue-Generating Business Processes","text":"*Camunda Survey Reveals Digital Transformation Is Very Important to Virtually All Software Pros and More Than Half Say Digital Disruption is Accelerating Very Rapidly*\n\n__BERLIN and SAN FRANCISCO, September 20, 2018__ - As companies bring more business functions online through digital transformation initiatives, the adoption of microservices architectures is becoming mainstream, according to a survey of 354 enterprises conducted by Camunda. Sixty-three percent of companies surveyed are currently using microservices architectures, with “improved employee efficiency,” “improved customer/end-user experience,” and “cost savings on infrastructure and other development tools” as the top three business benefits cited. The global survey was conducted in July 2018 and represents the views of software architects, engineering managers and other experts in application development, across 51 countries and twelve industries.\n\nDespite the growing popularity of microservices, the survey reveals that the majority of enterprises are largely unaware of the impact microservices architectures may have on their revenue-generating business processes. While 84 percent of enterprises factor business workflows into their broader business processes or workflows equation, only 45 percent explicitly document the business processes their microservices are part of. Additionally, the top challenge enterprises stated they are facing or are expecting to face with microservices architectures is lack of visibility into end-to-end business processes that span multiple microservices. \n\nOf the companies using/planning to use microservices:\n• 60 percent of respondents is doing so to achieve faster time to market for new products and services, and 54 percent is doing so to support digital transformation and to power next-generation applications. \n• 58 percent run or plan to run between 10-49 microservices in production, and 15 percent run or plan to run more than 100. \n• Lack of visibility into end-to-end business processes that span multiple microservices (59 percent), error handling issues at the boundary of two or more microservices (50 percent) and communication between teams (46 percent) are the top challenges respondents expect to face.\n\n“Microservices architectures provide teams with autonomy and flexibility but also introduce significant new challenges because a company’s core business processes nearly always span multiple microservices, making it difficult to gain visibility into the current state of an end-to-end process and to ensure that errors within a process are handled reliably and consistently,” said Jakob Freund, co-founder and CEO of Camunda. “Camunda’s survey makes it clear that while enterprises are adopting microservices for compelling reasons, the majority will be unintentionally limiting the benefits from the architecture and may even be impeding their ability to provide a better end user experience.”\n\nCompanies across many industries report they are undergoing digital transformation, with 90 percent of respondents saying that digital disruption has been accelerating either moderately, very or extremely rapidly in their industry over the past eighteen months. \n\nSurprisingly, given the rapid rate of change, respondents were not that bullish about budgets. Almost half expected their team’s budget to stay the same (49 percent), while only four out of ten (43 percent) expected it to grow. \n\nApplication Development Trends\n• 88 percent plan on using REST APIs for communication between microservices, while only 46 percent plan on using Apache Kafka, 30 percent plan on using RabbitMQ, and 21% plan on using Apache ActiveMQ.\n• Only 21 percent are facing or expecting to face security issues with a microservices architecture due to a large number of services.\n• But, more than half (56 percent) expected the size of their teams to increase in the next year, with only 3 percent expecting a decline.\n• 73 percent of firms using or planning to use microservices see it as very or extremely beneficial for building next-generation services and applications.\n• Nearly two thirds of the organizations surveyed (63 percent) are building some (18 percent) or all (46 percent) of their applications using microservices. \n• An additional quarter of organizations (28 percent) are considering using microservices for future applications \n\nCompanies report that the top reasons for adopting a microservices architecture are:\n• Improved scalability of applications (64 percent)\n• Faster time to market for new products and services (60 percent)\n• Supporting digital transformation efforts and powering next-generation applications (54 percent)\n• Giving development teams more autonomy (54 percent)\n• Increasing application resilience (50 percent)\n\n“Our survey found that of those firms using microservices, sixty-four percent agree that microservices are a very or extremely important enabling technology for digital transformation,” said Freund. “And even more see the benefits of using a microservices orchestration engine like Camunda. Sixty-nine percent of firms are using or planning to use Camunda BPM for visibility into end-to-end business processes and microservices orchestration use.”\n\n__About the Survey__\nOn behalf of Camunda, Researchscape International surveyed a range of worldwide professionals involved in the construction of applications about usage, attitudes and adoption of microservices architecture. This online survey had 354 respondents and was fielded from July 9 to July 30, 2018. Half the respondents were software architects (54 percent), 17 percent were software engineers, with the rest fairly evenly distributed between business analysts, product managers, engineering managers and other roles in application development. The countries with the broadest participation were Germany (26 percent), Russia (14 percent), and the United States (9 percent). In all, respondents from 51 countries participated in the study. \n\nThe survey respondents spanned more than twelve industries. Finance, insurance and real estate (28 percent) and software (27 percent) industries made up the majority, with telecommunications (8 percent), government (6 percent), Internet (5 percent), and transportation and warehousing (also 5 percent) rounding out the top five industries.\n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/ \n\n__Media Contacts:__\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com\n","date":"2018-09-20","technicalName":"new-research-shows-63-percent-of-enterprises-are-adopting-microservices-architectures-yet-50-percent-are-unaware-of-the-impact-on-revenue-generating-business-processes"},{"title":"Survey: Nearly 50% of EU companies worry about digital disruption","text":"__Berlin, September 27, 2018 - Fears of digital disruption are growing in the European Union. Forty-seven percent of companies report that the signs of disruptive changes in their own industry have increased significantly over the past 18 months. Hardly any type of industry is spared from this development. Only 12 percent of companies feel little or no threat. This is demonstrated by a survey conducted by the software company Camunda.__\n\nJust how quickly entire industries can be disrupted by digital innovations has long been proven by Amazon, Netflix and numerous financial technology companies that are targeting banks with easy-to-use digital solutions. However, when it comes to disruption, many companies misjudge, believes Jakob Freund, CEO and co-founder of Camunda. \"Amazon has already driven a wedge between customer and retail with the first book sold online,\" said Freund. \"Falling sales are just the leverage effect of a disruption that started much earlier.\"\n\nThe key to success for survival, therefore, is to develop early indicators in order to detect disruptive influences in one's own business model with plenty of time. \"If disruption can be deduced from the economic figures of a company, it's too late,\" says Freund. The best protection against digital disruptors is to build in-house digital competences, the Camunda boss says: \"Companies have to build a new self-image as a software company. In future, differentiation will only take place via the services offered. There will be software companies offering banking services and those building cars. But without in-house, high-performance software development capabilities, not a single company can do it.\"\n\n91% of EU companies have already realized that digital transformation is the key to long-term growth. Above all, this involves digitally rebuilding one's own organization and developing IT systems that can be flexibly adapted to constantly changing customer requirements. Fifty-six percent of respondents rate microservices as a critical success factor for the IT infrastructure of the future. A particular challenge here is the consistent mapping of core business processes. This is also reflected in the activities of microservices pioneers, such as the US streaming service Netflix, which has released its own microservices orchestration solution. \"Microservices enable novel applications that can be assembled and expanded like Lego kits. To ensure that overall business processes are not overlooked, it's necessary to have end-to-end oversight through workflow automation technology, \"says Jakob Freund.\n\nOver the next 18 months, the Camunda chief expects a competition for the best customer experience to develop. \"In the digital age, those who optimally serve their customers and can scale that ability will win,\" says Freund. \"What matters is that more traditional products such as insurance are as easy to buy and use for the customer as buying a product on Amazon.\"\n\n__About the survey__\n\nCamunda has interviewed more than 350 industry professionals worldwide to develop and deploy microservices-based software, including software architects (54 percent) and software engineers (17 percent), as well as business analysts, product managers and application developers. The survey was conducted by Researchscape International. The European Union, with more than 100 participants, accounted for around one third of responses. Firms in the finance, insurance and real estate sectors (28 percent) are the largest, followed by software (27 percent), telecommunications (8 percent), government (6 percent), internet (5 percent) and transport and warehousing (5 percent).\n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/ \n\n__Media Contacts:__\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \nJill Reed, Sift Communications, Jill.Reed@siftpr.com\n","date":"2018-09-27","technicalName":"survey-nearly-50-of-eu-companies-worry-about-digital-disruption"},{"title":"Workflow Automation Innovator Camunda Secures €25 Million in Series A Funding ","text":"•\tHigh-growth open source software company will use funding to further expand in US, Europe and Asia\n•\tFirst outside funding after being profitable since inception \n•\tEnterprise customers include more than 200 leading blue-chip banks, mobile operators, insurers and software companies \n\t\t\t\t\t\t\n__BERLIN and SAN FRANCISCO, December 5, 2018__ –– Camunda, creators of popular open source workflow automation software, has today announced a €25 million Series A financing from Highland Europe, marking the first time the company has taken outside investment. \n\nCamunda will use the new funds to accelerate global awareness of its solutions, drive continued product development and expand its organization in the United States, Europe and Asia. With annual recurring revenue (ARR) more than doubling over the past 12 months, Camunda’s growth has been fueled by global demand from both digital-native businesses and companies undergoing digital transformation. \n\nThe Camunda stack provides an integrated platform for software developers and business stakeholders, covering all phases of workflow automation: from process design and execution, to continuous process improvement. The stack includes a robust toolkit for modeling and executing business processes, coupled with powerful visual interfaces for monitoring and troubleshooting active processes and analyzing large volumes of process data.\n\nToday, instead of buying monolithic business systems off the shelf, modern organizations are composing their own bespoke technology stack that reflects their individual business model. Digital transformation means that companies need to automate core business processes – which are not rigidly baked into one system, but span multiple microservices and are constantly evolving – in a collaborative effort with software developers, as well as business stakeholders. To achieve this, a new generation of workflow automation infrastructure is needed, with Camunda’s solutions helping companies successfully navigate business process automation initiatives.\n\t\t\t\t\t\t\nCamunda users come from various industries, including financial services, telecommunications and insurance, as well as software companies seeking to embed Camunda’s workflow technology. More than 200 enterprise customers such as AXA Insurance, Intuit, T-Mobile, Universal Music Group and Zalando rely on Camunda’s software to automate core business processes such as eCommerce order executions, stock transactions, and insurance claim settlements.\t\t\t\t\n\t\t\t\t\nAt the heart of Camunda’s offering is the open source Workflow Engine which is built with developers top-of-mind, providing seamless integration points with an organization’s broader infrastructure. Camunda will continue to innovate on its product stack, with a specific focus on supporting modern use cases such as microservices orchestration, and high-scale scenarios for processing massive volumes of transactions with low latency.  \n\n“We are very excited to be working with Highland Europe, who share our long-term vision and cultural values,” said Jakob Freund, co-founder and CEO of Camunda. “Raising additional capital gives us the financial liberty to accelerate our growth and drive expansion, without having to compromise on product innovation.”\n\t\t\t\t\t\t\n“As digital transformation becomes a core focus for businesses across all industries, workflow automation has emerged as one of the fastest growing software categories globally. We’ve followed Camunda closely for several years and have been incredibly impressed by its product focus, capital efficiency and big ambition. We are thrilled to be partnering with the Camunda team on their next phase of expansion,” Sam Brooks, Partner at Highland Europe, said. \n\t\t\t\t\t\t\n__About Camunda__\n\t\t\t\t\t\t\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, Goldman Sachs, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n__About Highland Europe:__ \n\nHighland Europe invests in exceptional growth-stage software and internet companies. Active in Europe since 2003 as Highland Capital Partners and formally launched in 2012, Highland Europe has raised over €1 billion and has invested in companies such as Adjust, Bitmovin, ContentSquare, Featurespace, GetYourGuide, Huel, Malwarebytes, MatchesFashion, NewVoiceMedia, Nexthink, Smartly.io and WeTransfer. Highland’s collective history of investments across the US, Europe and China includes 46 IPOs and 19 billion-dollar plus companies.\n\nTo learn more, visit: www.highlandeurope.com.\n\t\t\t\t\t\t\nMedia Contact:\t\t\t\t\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com \n\n","date":"2018-12-05","technicalName":"workflow-automation-innovator-camunda-secures-25-million-in-series-a-funding"},{"title":"PwC Partners with Camunda to drive Digital Transformations","text":"•\tThe professional services network offers Camunda solutions as part of stack\n\t\t\t\t\t\t\n__BERLIN, April 29, 2019__ –– Camunda, an open source software company reinventing workflow automation, today announced that leading auditing and consulting firm PwC has joined the Camunda Partner Program. This program enables partners to integrate Camunda’s products and Enterprise platform into their offerings – supporting digital transformations for clients across the globe.\n \nWith digital disruption driving constant business change, staying competitive in today’s environment necessitates smart digital transformation and workflow automation – employing platforms that can evolve with businesses as they grow. Indeed, the workflow automation market is expected to reach nearly $17 billion by 2023, up from $4.7 billion in 2017.\n\nAs a Camunda partner, PwC now offers clients access to an integrated platform for software developers and business stakeholders, covering all phases of workflow automation: from process design and execution, to continuous process improvement. Camunda’s stack includes a robust toolkit for modeling and executing business processes, coupled with powerful visual interfaces for monitoring and troubleshooting active processes and analyzing large volumes of process data. \n\n“Remaining competitive in today’s digital world is a constant challenge,” said Jakob Freund, CEO and Co-Founder, Camunda. “This is why we’re delighted to partner with PwC, to fully enable clients from all industries to realize their digital transformation projects through workflow and decision automation.” \n\n\"We look forward to working with Camunda. The partnership will enable us to offer our clients a lean, flexible open source platform and help them automate their workflows and accelerate digital transformation,\" said PwC partner Sven Kilz.\n\n__END__\n\n\n__Press contacts:__\n\nJessica Jaffe\nCamunda | Sift Communications \nEmail: Jessica.Jaffe@siftpr.com \n\nSebastian Göb \nPwC | Marketing & Communications\nPhone: +49 211 9815189 | Mobile: +49 160 91748524\nEmail: sebastian.goeb@pwc.com\n\n\n__About PwC__\nAt PwC, our purpose is to build trust in society and solve important problems. We’re a network of firms in 158 countries with over 250,000 people who are committed to delivering quality in assurance, advisory and tax services. Find out more and tell us what matters to you by visiting us at www.pwc.com.\n \nPwC refers to the PwC network and/or one or more of its member firms, each of which is a separate legal entity. Please see www.pwc.com/structure for further details.\n\n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n\n\n\n","date":"2019-04-29","technicalName":"pwc-partners-with-camunda-to-drive-digital-transformations"},{"title":"Camunda Expands Partner Network with Infosys to Provide Open Source Workflow Automation","text":"__Berlin, May 23, 2019__ -- Camunda, a software company reinventing workflow and decision automation, today announced that Infosys has joined the Camunda Partner Program. As a Camunda partner, Infosys will offer its clients in North America and around the world access to an integrated platform for software developers and business stakeholders, covering all phases of workflow automation – from process design and execution, to continuous process improvement. Through this partnership, Infosys will offer its clients access to both Camunda’s open source and enterprise solutions.\n\nCamunda’s stack includes a robust toolkit for modeling and executing business processes, coupled with powerful visual interfaces for monitoring and troubleshooting active processes and analyzing large volumes of process data. Camunda also provides educational resources including the book Real-Life BPMN, that will enable Infosys to consult on BPMN ISO standards that Camunda helped shape.\n\n“We see many companies facing pressure to digitize and transform their business processes, and as a result IT services firms need partners who can fully enable their clients to complete their digital transformation projects,” said Jakob Freund, CEO and Co-Founder, Camunda. “Working with Infosys, especially with their market leadership position, will provide more businesses access to our workflow automation solutions.”\n\n“Infosys predicts that legacy systems will be the single biggest barrier to digital transformation in 2019,” says Gautam Khanna, Vice President, Global Head - Modernization Practice, Infosys. “We are excited to partner with Camunda and offer their lightweight and flexible platform to our clients that will further reduce their dependency on vendor-specific knowledge to integrate BPM software into existing product stacks, or to deploy new workflows.”\n\n\n__END__\n\n\n__Press contacts:__\n\nJessica Jaffe\nCamunda | Sift Communications \nEmail: Jessica.Jaffe@siftpr.com \n\n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n\n\n\n","date":"2019-05-23","technicalName":"camunda-expands-partner-network-with-infosys-to-provide-open-source-workflow-automation"},{"title":"Camunda to Offer Collaborative Workflow Modeling Tool Cawemo for Free","text":"*Cawemo SaaS platform enables business analysts, developers and product managers to create, review and model business processes together*\n\n__Berlin, May 28, 2019__ -- Camunda, a software company reinventing workflow automation, today announced that businesses can map their processes as workflows free of charge using Cawemo. The Cawemo SaaS platform will now be freely available to new customers and its more than 21,000 already registered users. Interested parties can register on the website [www.cawemo.com](https://www.cawemo.com) and test the cloud software immediately.\n \nCawemo was developed with business stakeholders and product managers in mind, enabling multiple individuals to collaborate on workflow processes on a single platform. It uses the BPMN 2.0 standard modeling language to graphically visualize workflows, which can be embedded in websites such as Confluence, exported as graphics for text documents such as Microsoft Word or loaded directly into Modeler, the developer tool of the Camunda stack. Later in 2019 users will also be able to automatically import process diagrams from the Camunda Engine and the Camunda Modeler, directly into the Cawemo platform.\n \n“Cawemo is the ‘Google Docs’ of business process modeling -- a collaborative platform where teams can work together simultaneously,” said Jakob Freund, CEO and co-founder of Camunda. \"Companies undergoing digital transformation need to automate core business processes in a collaborative effort with software developers, as well as business stakeholders. Cawemo brings all these parties together to help complete their goals.”\n \nThe Camunda Stack is currently offered as open source as well as in an enterprise license solution with professional support. Companies that already have a Camunda Enterprise license will immediately have free access to Cawemo.\n\n\n__END__\n\n\n__Press contacts:__\n\nJessica Jaffe\nCamunda | Sift Communications \nEmail: Jessica.Jaffe@siftpr.com \n\n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n\n\n\n","date":"2019-05-28","technicalName":"camunda-to-offer-collaborative-workflow-modeling-tool-cawemo-for-free"},{"title":"Mphasis Partners with Camunda to Boost Clients’ Workflow and Decision Automation Capabilities","text":"\n__New York, June 10, 2019__ -- Mphasis, an Information Technology solutions provider specializing in cloud and cognitive services, today announced its partnership with global software company Camunda, which specializes in BPM (Business Process Management), to gain a stronger digital foothold for existing clients and partners and further grow presence in global markets across financial services. \n\nMphasis’ strategic partnership will increase value-added services with Camunda’s cloud and BPM technology, capturing larger market share, enhance onboarding services for new clients, increase top line revenues and upgrade bottom-line operations with partner tools and frameworks. \n\nFurthermore, Mphasis’ experience as a seasoned technology service provider, combined with Camunda’s expertise in building strong workflow and decision automation assets in banking and insurance verticals, will offer faster time-to-market and high value services for customers in the insurance and banking sectors. \n\nCamunda BPM is an open-source workflow and decision automation platform, with tools for creating workflow and decision models, operating deployed models in production, and allowing users to execute workflow tasks assigned to appropriate recipients. This platform fits Mphasis’ clients’ demand for microservice-based workflow and decision management platforms at a lower price point, as well as the ability for greater flexibility of integrating with modern user interfaces. \n\n“This partnership with Camunda provides businesses the nimbleness to address customer needs faster with hyper-personalization of customer experiences. It underscores our commitment to assist enterprise clients to quickly deliver superior products and service experiences, while optimizing costs and simplifying critical multi-cloud operations strategy,” said Dinesh Venugopal, President - Mphasis Direct and Digital. \n\n“Today, staying ahead of the game necessitates smart, agile digital transformation” said Jakob Freund, CEO and Co-founder, Camunda. “We are excited to partner with Mphasis, who offer next generation services across the IT sector in both traditional and emerging technologies, which will further enable our customers’ digital transformation capabilities.”\n\n\n\n__END__\n\n\n__Press contacts:__\n\nDeepa Nagraj\nMphasis Corporate Communications \ndeepa.nagaraj@mphasis.com\n+1 (347) 268-0661 | +1 (646) 424-5160\n+91 9845 256 283\n\nSumana Bhat\nMphasis Corporate Communications \nSumana.bhat@mphasis.com\n09902980980\n\nJessica Jaffe\nCamunda | Sift Communications \nEmail: Jessica.Jaffe@siftpr.com \n\n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: [https://camunda.com/](https://camunda.com)\n\n\n__About Mphasis__\n[Mphasis](http://www.mphasis.com/ \"Mphasis\") (BSE: 526299; NSE: MPHASIS) applies next-generation technology to help enterprises transform businesses globally. Customer centricity is foundational to Mphasis and is reflected in the Mphasis’ [Front2Back](https://www.mphasis.com/home/our-approach.html)™ Transformation approach. Front2Back™ uses the exponential power of cloud and cognitive to provide hyper-personalized (C=[X2C2](https://www.mphasis.com/home/our-approach.html) TM=1) digital experience to clients and their end customers. Mphasis’ Service Transformation approach helps ‘shrink the core’ through the application of digital technologies across legacy environments within an enterprise, enabling businesses to stay ahead in a changing world. Mphasis’ core reference architectures and tools, speed and innovation with domain expertise and specialization are key to building strong relationships with marquee clients. Click [here](http://www.mphasis.com/) to know more.\n\n\n\n","date":"2019-06-10","technicalName":"mphasis-partners-with-camunda-to-boost-clients-workflow-and-decision-automation-capabilities"},{"title":"Umfrage: Banken fordern höhere Zinsen und weniger Regeln - German Only ","text":"","date":"2019-06-18","technicalName":"umfrage-banken-fordern-hohere-zinsen-und-weniger-regeln-german-only"},{"title":"Camunda Announces Extensive Speaker Lineup for CamundaCon 2019","text":"\n*Early Bird Tickets for the annual Camunda Community event available until June 30th\n*\n\n__Berlin, June 24. 2019__: Camunda, an open source software company reinventing workflow automation, today announced the speaker lineup for its annual user conference – [CamundaCon](https://www.camundacon.com/home \"CamundaCon\") –  featuring presenters from LinkedIn, Roche and AXA, among others. Demand for the tech-focused event is significantly outpacing last year and discounted Early Bird tickets are available only until June 30th. \n\nCamundaCon, an event created for software developers, enterprise architects and IT executives who want to learn about workflow and decision automation, takes place September 12-13 in the heart of Berlin. It brings together workflow automation and BPMN experts, the global Camunda community and the Camunda engineering team to share best practices, discuss the product roadmap and get inspiration from fellow Camunda users. \n\nNew this year to the annual conference is a developer-focussed track, with dedicated tutorials and workshops from Camunda experts in the core product stack, from extending the popular Camunda Modeler tool, to scaling distributed workflow engines. \n\nCamundaCon 2019 will see speakers from a diverse array of industries presenting case studies and technical solutions to problems solved with Camunda’s workflow and decision automation platform. \n\nCamundaCon 2019 features 50 sessions with speakers including:\n\n- LinkedIn Senior Site Reliability Engineer Akhil Ahuja \n- UK Home Office CTO Richard Howells \n- AXA Konzern AG Manager IT-BPM and Product Owner Niko Vogel\n- Lufthansa Technik Head of Technology & Infrastructure Tobias Mohr; and Johannes Hansen, Senior Director Process Automation & Technology Platform\n- Roche Solutions Architect Daniel Butnaru\n- Australia Post Enterprise Architect Rob Parker\n- Deutsche Telekom Project Manager IT Application Friedbert Samland\n\n\n__Learn more and register:__\nTo register and learn more about CamundaCon 2019 visit: [https://www.camundacon.com/](https://www.camundacon.com/ \"https://www.camundacon.com/\")\n\n\n__ENDS__\n\n__Press Contacts__\n\nJessica Jaffe, Jill Reed \nSift Communications\ncamunda@siftpr.com\n\nDeutschland:\nFlorian Bongartz\nflorian.bongartz@econ-news.de\n+49 176 20250099\n\n\n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n\n\n","date":"2019-06-24","technicalName":"camunda-announces-extensive-speaker-lineup-for-camundacon-2019"},{"title":"Umfrage: Zwei Drittel der Versicherer entwickeln Software selbst","text":"","date":"2019-06-25","technicalName":"umfrage-zwei-drittel-der-versicherer-entwickeln-software-selbst"},{"title":"Umfrage: Banken fürchten Apple, Google und Paypal am meisten","text":"","date":"2019-07-04","technicalName":"umfrage-banken-furchten-apple-google-und-paypal-am-meisten"},{"title":"Umfrage: Versicherer fürchten Online-Konkurrenz am meisten","text":"","date":"2019-07-11","technicalName":"umfrage-versicherer-furchten-online-konkurrenz-am-meisten"},{"title":"Fintechs: 70 Prozent der Banken wollen Blase platzen sehen","text":"","date":"2019-07-16","technicalName":"fintechs-70-prozent-der-banken-wollen-blase-platzen-sehen"},{"title":"Camunda Releases Industry’s First Horizontally Scalable, Cloud-Native Workflow Engine for Microservices","text":"*Free Community Edition of Zeebe provides visibility into and control over business processes in distributed architectures, monitors across microservices and offers a view into the live state of a business*\n\n__BERLIN--July 17, 2019:__ [Camunda](https://camunda.com/ \"Camunda\"), a software company reinventing workflow automation, today announced that the first-ever production-ready release of Zeebe is now available for download as a free Community Edition. Zeebe is a modern workflow engine built for cloud architectures that provides visibility into and control over workflows that span multiple microservices. Zeebe integrates with cloud-native components like Kubernetes, Apache Kafka and Elasticsearch, executes industry standard BPMN – a well-established graphical modeling language for business processes – and is fault tolerant without requiring a database. \n\nWith companies increasingly digitizing business processes, there has been a significant rise in distributed microservices architectures. In fact 64% of enterprises are using microservices for some or all of the applications they’re building, according to a recent Camunda survey about enterprise use of microservices. \n\n__Challenges of Microservices for Common Business Use-Cases__\nYet these architectures lead to challenges when applied at scale in common business scenarios. For example, an e-commerce company’s order fulfillment process might be carried out by multiple microservices – payment, inventory, and shipping services – while no team is actually responsible for an end-to-end order as it moves through different services. According to 59% of enterprises, the lack of visibility into end-to-end business processes spanning multiple microservices is a challenge.\n\n__Orchestrating Microservices To Create Scalable Business Workflows__\nZeebe is a next-generation workflow engine that leverages event streaming to scale horizontally on cloud-native architectures, and is designed with the microservices orchestration use case at top of mind. \nWith Zeebe, software developers can for the first time:\n- Design, execute and manage microservices-based workflows at cloud scale\n- Gain visibility into cross-microservice workflows, monitoring all running workflow instances across microservices \n- Orchestrate cross-microservice workflows, ensuring that all flows finish within business SLAs and that issues requiring manual intervention are detectable and fixable. \n- Maintain an audit log of historic workflow data for analysis\n\n“According to 64% of microservices adopters, microservices have resulted in improved scalability of applications, and 60% are able to bring new products to market more quickly,” says Daniel Meyer, CTO Camunda. “We’re excited to now offer a production-ready version of Zeebe, which supports mission-critical business processes that previously couldn't be handled by a workflow engine due to their scalability or architectural requirements.”\n\n“Using Zeebe crystallises the behaviour of our separate systems in one place, rather than it being diffused throughout the code or the minds of senior engineers,”  says Jarred Filmer, Software Engineer, Credit Sense. “And because Zeebe diagrams have to actually execute, they act as an effective communication bridge between operations (managers, business analysts, etc) and engineering. Everyone having a representation for every part of the system with something they can point to is powerful.”\n\nZeebe is the latest addition to the Camunda technology stack that provides an integrated platform for software developers and business stakeholders, covering all phases of workflow automation, from process design and execution, to continuous process improvement. The stack includes a robust toolkit for modeling and executing business processes, coupled with powerful visual interfaces for monitoring and troubleshooting active processes and analyzing large volumes of process data.\n\n*Free Community Edition Immediately Available\nZeebe is distributed as a free and source-available Community Edition and available for immediate download at  http://zeebe.io*\n\n__Learn more__\n- Release announcement blog post: https://zeebe.io/blog/2019/07/announcing-zeebe-0-20-production-ready/ \n- Release webinar registration: https://camunda.com/learn/webinars/zeebe-mid-year-update-july-2019/\n- \n\n\n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n\n__Camunda Media Contact:__\nJessica Jaffe\nSift Communications \nJessica.Jaffe@siftpr.com \n\n","date":"2019-07-17","technicalName":"camunda-releases-industrys-first-horizontally-scalable-cloud-native-workflow-engine-for-microservices"},{"title":"Wipro Partners with Camunda to Offer Workflow Automation Platform","text":"__Berlin, Germany and Bangalore, India – August 8, 2019:__ Wipro Limited (NYSE: WIT, BSE: 507685, NSE: WIPRO), a leading global information technology, consulting and business process services company and [Camunda](https://www.camunda.com), an open source software company reinventing workflow automation, today announced that Wipro has joined the Camunda Partner Program.\n\nThis program will enable Wipro to integrate Camunda’s products and Enterprise Platform with its offerings, and help customers who need workflow automation, but may not have the IT resources to build it themselves. \n\nThe workflow automation market is expected to reach nearly $17 billion by 2023, up from $4.7 billion in 2017. With digital disruption driving constant business change, staying competitive in today’s environment necessitates smart digital transformation and workflow automation. This involves employing platforms that can evolve with businesses as they grow. \n\nAs a Camunda partner, Wipro can now offer clients access to an integrated platform for software developers and business stakeholders, covering all phases of workflow automation – from process design and execution, to continuous process improvement. Camunda’s stack includes a robust toolkit for modeling and executing business processes, coupled with powerful visual interfaces for monitoring and troubleshooting active processes and analyzing large volumes of process data. \n\n“As digital transformation initiatives increasingly pick up speed, we’re finding more and more IT services firms need partners who can fully enable their clients’ digital transformation projects,” said Jakob Freund, CEO and Co-founder, Camunda. “We are thrilled to work with Wipro, whose market leadership position will provide more businesses access to our workflow automation solutions.”\n\n“We are excited to partner with Camunda to offer customers a lightweight, highly flexible, open source platform for their workflow automation needs,” said Somit Kapoor, Head of Enterprise Operations Transformation, Wipro Limited. “Offering Camunda as part of our stack will benefit our customers who are looking for a solution that offers greater flexibility and customization than alternative heavyweight platforms.”\n\n__END__ \n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n__Camunda Enterprise__\nThe Camunda Enterprise Platform is based on the company’s popular open source workflow and decision automation platform and includes additional features, guarantees and services to enable accelerated development of workflow solutions and rock-solid production deployments.\nThe Enterprise Platform features an advanced version of Cockpit for operating production deployments of BPMN workflows and DMN decisions, and includes Optimize 2.0 for rich data visualization, flexible alerting and advanced analytics. Camunda Enterprise users also receive SLA-based support and maintenance, contractual warranties, ongoing maintenance, and training and consulting services.\n\n__Camunda Media Contact:__\nJessica Jaffe\nSift Communications \nJessica.Jaffe@siftpr.com \n\n\n__About Wipro Limited__\nWipro Limited (NYSE: WIT, BSE: 507685, NSE: WIPRO) is a leading global information technology, consulting and business process services company. We harness the power of cognitive computing, hyper-automation, robotics, cloud, analytics and emerging technologies to help our clients adapt to the digital world and make them successful. A company recognized globally for its comprehensive portfolio of services, strong commitment to sustainability and good corporate citizenship, we have over 170,000 dedicated employees serving clients across six continents. Together, we discover ideas and connect the dots to build a better and a bold new future. \n\n\n__Wipro Media Contact:__\nPurnima Burman\nWipro Limited\npurnima.burman@wipro.com\n\n__Forward-looking and Cautionary Statements__\nCertain statements in this release concerning our future growth prospects are forward-looking statements, which involve a number of risks, and uncertainties that could cause actual results to differ materially from those in such forward-looking statements. The risks and uncertainties relating to these statements include, but are not limited to, risks and uncertainties regarding fluctuations in our earnings, revenue and profits, our ability to generate and manage growth, intense competition in IT services, our ability to maintain our cost advantage, wage increases in India, our ability to attract and retain highly skilled professionals, time and cost overruns on fixed-price, fixed-time frame contracts, client concentration, restrictions on immigration, our ability to manage our international operations, reduced demand for technology in our key focus areas, disruptions in telecommunication networks, our ability to successfully complete and integrate potential acquisitions, liability for damages on our service contracts, the success of the companies in which we make strategic investments, withdrawal of fiscal governmental incentives, political instability, war, legal restrictions on raising capital or acquiring companies outside India, unauthorized use of our intellectual property, and general economic conditions affecting our business and industry. Additional risks that could affect our future operating results are more fully described in our filings with the United States Securities and Exchange Commission. These filings are available at www.sec.gov. We may, from time to time, make additional written and oral forward-looking statements, including statements contained in the company’s filings with the Securities and Exchange Commission and our reports to shareholders. We do not undertake to update any forward-looking statement that may be made from time to time by us or on our behalf. \n\n\n","date":"2019-08-08","technicalName":"wipro-partners-with-camunda-to-offer-workflow-automation-platform"},{"title":"Camunda Opens Sold-out CamundaCon 2019","text":"*Preeminent Camunda Community event showcases workflow technology innovation, real-world case studies and business process best practices *\n \n__Berlin, September 12. 2019:__ [Camunda](https://camunda.com/), an open source software company reinventing workflow automation, today commences its annual user conference – [CamundaCon ](https://www.camundacon.com/home)– featuring more than 50 speakers from a diverse array of companies including LinkedIn, AXA, Lufthansa, Roche, Australia Post, and Deutsche Telekom, along with business process and workflow automation thought leaders and technologists.\n\nThis year’s event will be kicked off with keynotes by Camunda’s co-founder and CEO Jakob Freund and CTO Daniel Meyer, showcasing upcoming trends and key innovations in workflow automation. Additional keynote speakers include the award-winning BPMN author, analyst and expert Sandy Kemsley, as well as technologists Susanne Kaiser and Bernd Rücker, one of Camunda’s co-founders, who will focus on Microservices environments and how to establish best-practices in this fast-developing architecture.\n \nCamundaCon, an event created for software developers, enterprise architects and IT executives who want to learn about workflow and decision automation, takes place September 12-13 in the heart of Berlin. New to the event this year, Camunda has introduced a developer-focused track, with dedicated tutorials and workshops designed for workflow automation practitioners, led by Camunda product experts.  \n\n“CamundaCon brings together the best workflow automation and BPMN experts, the global Camunda community and the Camunda engineering team” said Gottfried Sehringer, chief marketing officer at Camunda. “We are thrilled to see so many experienced Camunda users from all around the world to come together and share their expertise and best practices, present case studies around business process management, and discuss the latest advancements in workflow and decision automation technology.” \n\nKeep up with CamundaCon using the social media hashtag __#camundacon__ and stay updated with daily news and blogs: [https://blog.camunda.com/](https://blog.camunda.com/)\n \n \n \n__ENDS__\n \nPress Contacts\n \n__International__\nJessica Jaffe, Jill Reed\nSift Communications\ncamunda@siftpr.com\n \n__Deutschland:__\nFlorian Bongartz\npresse@camunda.com\n+49 176 20250099 \n \n \n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n \nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n","date":"2019-09-12","technicalName":"camunda-opens-sold-out-camundacon-2019"},{"title":"Camunda Announces Camunda Cloud: Workflow Engineered for the Cloud ","text":"*First BPMN-based and horizontally scalable workflow automation technology available as a service*\n\n__BERLIN – September 12, 2019__ – [Camunda](https://camunda.com/), the software company reinventing workflow automation, today launched [Camunda Cloud](http://camunda.com/cloud) at its annual user conference [CamundaCon](https://www.camundacon.com/). Camunda’s new offering delivers a fully managed, cloud-native workflow tech stack for developers to design, automate and manage their business-critical processes, easily scale with transaction processing needs and improve their productivity. This new solution enables developers to continue to use their preferred cloud tools and focus on building and improving applications instead of the complexities of managing a distributed system at scale. \n\nCamunda Cloud is the first BPMN-based workflow technology that has been engineered specifically for the cloud as an on-demand cloud service.  It is architected around the [recently released](https://camunda.com/about/press/camunda-releases-industrys-first-horizontally-scalable-cloud-native-workflow-engine-for-microservices/) cloud-native workflow engine [Zeebe](https://zeebe.io/) and its monitoring tool Operate, along with the collaborative workflow modeling tool Cawemo.\n\n“On demand, enterprise-class workflow technology has been the missing link for efficient and scalable cloud-native application development,” said Jakob Freund, Camunda’s CEO and Co-founder. “Camunda is now filling this void with a powerful, secure, and high-performing workflow platform engineered for the age of the cloud. This allows development teams charged with automating complex business processes to focus on the business and customer needs and rely on Camunda Cloud for an on-demand, highly scalable and sophisticated workflow service.”\n\n__Workflows play a central role in business-critical applications - with no scalable, cloud solution for enterprise IT teams until now.__\nAs IT teams at companies around the world are rushing to move more and more software applications into the cloud to take advantage of the inherent flexibility, cost savings and scalability, they have limited options when building applications that include workflows. As a result, IT teams resort to hard-coded workflows or have to manage their own workflow tech stack and infrastructure. This requires considerable cloud expertise and takes time and resources away from development teams already struggling to keep up with business demand.\n\nCamunda Cloud makes it easy for developers to access a workflow technology stack on demand which has been specifically engineered for the cloud. It provides development teams with: \n\n__Workflow tech stack engineered for the cloud:__ Camunda’s new solution instantly provides a workflow automation tech stack that is designed for infinitely scalable cloud infrastructures while integrating seamlessly with best-in-class, cloud-native components. \n\n__Cloud scale and flexibility:__ Using this service teams can rely on the power of the cloud to scale their workflow processing needs up and down as needed.\n\n__Improved developer productivity:__ Camunda Cloud enables developers to continue to use their preferred cloud tools and focus on building and improving applications instead of the complexities of managing a distributed system at scale. \n\n__Camunda Cloud includes:__\n\n__On-demand, fully managed, secure cloud platform:__ Camunda’s workflow automation experts manage the platform, ensuring a stable and secure environment and providing technical support along the way. \n\n__Horizontally-scalable, fault-tolerant workflow engine:__ This new solution is powered by  [Zeebe](https://camunda.com/about/press/camunda-releases-industrys-first-horizontally-scalable-cloud-native-workflow-engine-for-microservices/), the industry’s first horizontally scalable, cloud-native BPMN workflow engine, making it possible to orchestrate large-scale workflows that previously could not be handled by a workflow engine. \n\n__Robust tools for monitoring and problem solving__: Camunda Cloud includes a visual dashboard for workflows that was designed specifically for the technical operators who are responsible for monitoring and managing running workflow instances.\n\n__Online, collaborative process design for Business and IT:__ Camunda’s new service allows business and IT teams to easily collaborate online to jointly design their business processes and workflow automation.\n\n__Availability__\nCamunda Cloud is currently available via an [early access beta program](https://camunda.com/cloud). Interested developers can request access at [https://camunda.com/cloud](https://camunda.com/cloud). \n\n__Live at CamundaCon 2019:__ Attendees of CamundaCon 2019 can watch a live demo and request beta access directly at Camunda’s “Ask me Anything” booth on site.\nLearn More\nCamunda Cloud product page: [https://camunda.com/products/cloud](https://camunda.com/products/cloud)\nCamunda blog: [https://blog.camunda.com ](https://blog.camunda.com)\nZeebe cloud-native workflow engine: [https://zeebe.io](https://zeebe.io) \n\n__About Camunda__ \nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/ \n\n__Camunda Media Contacts __\n\nInternational\nJessica Jaffe, Jill Reed\nSift Communications\ncamunda@siftpr.com\n \nDeutschland\nFlorian Bongartz\nflorian.bongartz@econ-news.de\n+49 176 20250099\n\n","date":"2019-09-12","technicalName":"camunda-announces-camunda-cloud-workflow-engineered-for-the-cloud"},{"title":"Updated fourth edition of Real-Life BPMN by Camunda Co-founders Released","text":"*The hugely popular book, currently published in three languages, has been updated to reflect the growing trend towards microservice architectures * \n \n \n__Berlin, September 13. 2019:__ The co-founders of [Camunda](https://camunda.com/), an open source software company reinventing workflow automation, today released an updated, fourth English edition of *Real-Life BPMN* at the preeminent annual user conference [CamundaCon](https://www.camundacon.com/). The hugely popular handbook enables developers, architects, business analysts and business process owners to learn about and implement the global Business Process Model and Notation standard.\n\n*Real-Life BPMN*, written by Camunda Co-Founders [Bernd Rücker](https://berndruecker.io/) and Jakob Freund, is based on the ISO BPMN 2.0 standard that they helped create. Published in English, German and Spanish, it has sold more than 35,000 copies worldwide to date. \n\nThe fourth edition was sparked by the rising popularity of microservice architectures -- slicing functionality into smaller pieces which can be developed and maintained autonomously. A [2018 Camunda Survey](https://camunda.com/microservices-orchestration-survey-results-2018/) revealed 63% of companies had already adopted microservice architectures and the updated handbook addresses how splitting business logic into microservices affects business processes and BPMN models.   \n\nCo-Author of the book, Bernd Rücker, Co-Founder and Chief Technologist, Camunda, says: “I think our book has been so popular because it equips anyone who’s interested in using BPMN with easy-to-follow guidance and best practices, especially in the context of workflow automation endeavours. In fact, in this latest edition, we’ve introduced guidelines to avoid creating BPMN monoliths that conflict with microservices architectures. This is particularly important as companies are modernizing their IT architectures, moving to the cloud and striving to respond to the ever increasing business demand for more software applications.” \n\n*Real-Life BPMN* -- [available now ](https://www.amazon.com/dp/1086302095)--  has been praised for making the complex topic of workflow modelling accessible, with its clear structure, easy-to-follow examples and a genuine sense of humour often lost in technical publications. \n \n__ENDS__\n\n__To learn more,__ join Jakob Freund and Bernd Rücker in [a webinar on October 16th](https://camunda.com/learn/webinars/real-life-bpmn/), where they’ll explain the latest *Real-Life BPMN* updates and best practices.  \n\n\n\n__Press Contacts__\n \n__International__\nJessica Jaffe, Jill Reed\nSift Communications\ncamunda@siftpr.com\n \n\n__Deutschland__\nFlorian Bongartz\npresse@camunda.com\n+49 176 20250099\n \n\n \n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n \nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n\n","date":"2019-09-13","technicalName":"updated-fourth-edition-of-real-life-bpmn-by-camunda-co-founders-released"},{"title":"Camunda Launches New Release of Open Source Platform to Accelerate Business Process Automation","text":"\n*Community-driven enhancements to Camunda BPM 7.12 help companies of all sizes advance workflow and decision automation*\n\n__BERLIN, December 3, 2019__ -- Camunda, a software company reinventing workflow automation, today announced the release of Camunda BPM 7.12. This new release adds even greater functionality to Camunda’s leading open source platform for workflow and decision automation, including support for high-volume, mission critical scenarios, an improved modeling experience and more powerful BPMN execution.\n\nCamunda BPM 7.12 delivers workflow enhancements and operational efficiencies, bringing even more value to Camunda customers and the Camunda community: \n\n- __Advanced BPMN execution capabilities__, with support for triggering BPMN Error and Escalation events from user tasks and time-triggered listeners, as well as improvements to the task listener lifecycle \n\n- __Enhanced collaboration with technical operators on Cockpit__ via capabilities for annotating operations with comments and inspecting documentation on BPMN elements\n\n- __Improved operations__: Powerful additions to the logging API, updated Docker Container, running Camunda BPM in Kubernetes and additional supported environments (Java 13, Wildfly 12/13)\n\n- __Improved modeling__: support for BPMN Groups and Grid Snapping as well as enhancements to navigation, editing, and deployment of processes from the modeler\n\n“Camunda BPM is fast becoming the de facto standard for business process automation,” said Camunda’s CTO, Daniel Meyer. “Continuous improvement is at the heart of what we do. We are pleased to deliver a 7.12 release full of enhancements driven by our vibrant user community to help businesses of all shapes and sizes advance their workflow and decision automation projects.”\n\n__ENDS__\n\n__Availability__\nCamunda BPM is distributed as a free, open source Community Edition as well as a commercial Enterprise Edition. Open source downloads and a free trial of the enterprise Edition are available at [www.Camunda.com/download](http://www.Camunda.com/download) \n\n__Learn more__\n\n[Camunda BPM 7.12 release webinar ](https://camunda.com/learn/webinars/camunda-bpm-7-12-release-webinar-en/)\n[Camunda BPM 7.12 release blog](https://blog.camunda.com/post/2019/11/camunda-bpm-7120-released/)\n[Camunda Modeler release blog](https://blog.camunda.com/post/2019/11/camunda-modeler-3.5.0-released/) \n\n\n__Press Contacts__\n\n__International__\nJessica Jaffe, Jill Reed\nSift Communications\ncamunda@siftpr.com\n\n__Germany__\nFlorian Bongartz\npresse@camunda.com\n+49 176 20250099\n\n\n__About Camunda__\nCamunda is a software company reinventing workflow automation. Hundreds of companies including 24 Hour Fitness, AT&T, Lufthansa Technik and Zalando trust Camunda to automate core business processes to the highest possible extent, allowing their business to scale and revenue to grow without proportionally increasing operating costs.\n\nWith its open source-based workflow automation and decision platform, Camunda provides detailed visibility into business operations across distributed systems, boosts system resilience and enables enterprises to overcome “big workflow” challenges resulting from digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: https://camunda.com/\n\n\n\n\n\n","date":"2019-12-03","technicalName":"camunda-launches-new-release-of-open-source-platform-to-accelerate-business-process-automation"},{"title":"Camunda Announces Speaker Lineup for CamundaCon New York","text":"*Early Bird Tickets for April 23-24 Camunda User Conference Focusing on Process Automation Available Until February 29*\n\n__BERLIN, Germany and WALTHAM, Mass.__ – February 26, 2020 – [Camunda](https://www.camundacon.com/ \"Camunda\"), creators of developer-friendly, open source process automation software, today announced an extensive speaker lineup for [CamundaCon New York](https://www.camundacon.com/event/a47c0cb7-c915-4e48-97bc-7775f59bbe44/summary \"CamundaCon NY\"), taking place April 23-24 at [Union West](https://www.camundacon.com/event/a47c0cb7-c915-4e48-97bc-7775f59bbe44/websitePage:8030fda1-38af-4dc1-9e8c-0f56f3fd796e?__hstc=252030934.923a1840f300ede8ef7f016cc11cf230.1568138224960.1582129128934.1582301141428.17&__hssc=252030934.5.1582301141428&__hsfp=1214804991) in New York City. CamundaCon is the premier event for software developers, architects and IT executives interested in learning about modern, scalable process automation for the cloud era.\n\nWith more than 20 sessions, the two-day event features speakers from visionary companies including Capital One, Cox Automotive, Keller Williams and Nokia Bell Labs, who will share how they solved real-world problems through workflow and decision automation. Keynote speaker Simon Letort, Chief Digital Officer at Société Générale, will discuss how this top ranked digital company, serving 31 million clients, has created a managed workflow platform using Camunda software that powers more than 500 modeled processes worldwide. \n\nFollowing a sold-out CamundaCon Berlin in 2019, CamundaCon will take place in both New York and Berlin in 2020, enabling the global user community to connect, share ideas and best practices and discuss requirements directly with Camunda engineers.\n\nCamunda experts including CTO Daniel Meyer, Chief Technologist Bernd Ruecker and CEO Jakob Freund, will be available to guide audience members through the Camunda product stack throughout CamundaCon New York, with insightful sessions suitable for beginners and advanced users. In addition, just preceding the event, Camunda is hosting several [training sessions](https://camunda.com/services/training/) as well as a hands-on [Developer Workshop](https://www.camundacon.com/event/a47c0cb7-c915-4e48-97bc-7775f59bbe44/websitePage:9810eea3-6aa4-488b-bf56-464815ace8f0?__hstc=252030934.923a1840f300ede8ef7f016cc11cf230.1568138224960.1582129128934.1582301141428.17&__hssc=252030934.5.1582301141428&__hsfp=1214804991) which will teach participants how to build a more resilient business process.  \n\nCamundaCon New York will feature sessions from experts across an array of industries including:\n- __Capital One__ Senior Software Engineering Manager Muthukumar Vaidhianathan; and Tandeep Sidhu, Software Engineering Manager\n- __Cox Automotive__ Senior Software Engineer Mary Rose Matira; and Liz Hesser, Lead UI Engineer\n- __Nokia Bell Labs__ Software Project Lead in Industrial and Enterprise Automation Lab Kris Barczynsk \n- __Ontario Teachers' Pension Plan__ Director, Solution Engineering - Member Services Derek Hunter; and Uzma Khan, Senior Software Developer, Solution Engineering - Member Services \n- __BP3__ Global Open Source Solutions Engineer Jeremy Warren \n- __The Institutes'__ RiskStream Collaborative Head of Technology Patrick Millar\n\n__Learn more and register:__\nEarly bird tickets are available starting at $399 until February 29, 2020. To register and learn more about CamundaCon NYC visit: [https://www.camundacon.com/](https://www.camundacon.com/)\n\n__Press Contacts__\nJessica Jaffe\nSift Communications\ncamunda@siftpr.com\n\n__About Camunda__\nCamunda is an open source software company innovating process automation with a developer-friendly approach that is standards-based, highly scalable and collaborative for business and IT. \nA community of thousands of users across companies such as Allianz, ING and T-Mobile design, automate and improve mission-critical business processes end-to-end with Camunda, enabling them to build software applications more flexibly, collaboratively and efficiently, gaining the business agility, visibility and scale needed to drive digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: [https://camunda.com/](https://camunda.com/)","date":"2020-02-26","technicalName":"camunda-announces-speaker-lineup-for-camundacon-new-york"},{"title":"Digital Transformation: Deutsche Telekom Counts on Camunda for Process Automation and RPA Orchestration","text":"<ul>\n<li>Deutsche Telekom is driving the digital transformation of the company and is using Camunda to automate processes in its customer service sector, among other areas</li>\n\n\n<li>One of the largest Robotic Process Automation (RPA) implementations in Europe is being orchestrated and gradually transitioned from front-end to back-end automation</li>\n\n\n<li>As a result, processes can be automated faster, are easier to customize and more scalable</li>\n</ul>\n\n\n \n__BERLIN, March 17, 2020__ - Open-source software provider Camunda is powering Deutsche Telekom’s customer service sector with its successful Process Automation platform. The leading German telecommunications provider has embraced process automation to drive digital transformation company-wide and replace inefficient processes. At Deutsche Telekom, Camunda enables the orchestration of more than 2,500 individual software robots (RPA bots), as well as the transition of the current frontend automation to a less maintenance-intensive and better-integrated backend automation, providing further automation and savings opportunities.\n \nDeutsche Telekom aims to better support the customer service function digitally and improve   process automation. The company has moved further than most European businesses in developing an army of more than 2,500 RPA bots to automatically handle and improve manual processes, resulting in annual savings of approximately 100 million euros. The next step for the company is to transform this \"front-end automation\" technology – which is expensive to maintain, manage errors and control business processes end-to-end – into backend automation, integrated more strongly with core IT systems.\n \nWith Camunda BPM, there is now a central platform for process automation that ensures IT systems and RPA bots can be addressed directly via APIs, and all required information can be exchanged digitally from start to finish. Going forward, these RPA bots will be increasingly replaced by API-based interfaces, which is easily done without having to further adapt the business processes in Camunda. This shift will provide a smooth migration to an IT infrastructure that enables a sustainable digital transformation.\n \n\"We are proud to have made the move towards digital transformation very early on and built one of the largest RPA platforms in Europe,\" says Marco Einacker, Vice President Service IT at Deutsche Telekom. \"Building on our RPA experience, we are now entering the next phase, automating processes from start to finish with the help of Camunda to accelerate digital transformation quickly and sustainably.\"\n \n\"Automated processes are at the heart of any digital enterprise,\" says Jakob Freund, CEO, Camunda. \"To achieve this, business and IT must effectively collaborate and processes must be continuously managed across a wide range of technical systems. RPA is a useful short-term solution for many companies to selectively automate the work of individual components in legacy systems. The next step is to include these isolated RPA bots in continuous process control and, where possible, gradually replace them with real API services. We are delighted to accompany Deutsche Telekom on its way to becoming a digital enterprise with Camunda BPM.\"\n \nWith Camunda BPM software, complete processes and complex decisions can be designed, automated and improved. This cohesive approach makes it easier for companies to manage complex processes across multiple IT systems automatically, much faster and more cost-effectively than before. Camunda supports the established BPMN and DMN standards, which enables effective communication between business stakeholders and software developers. With end-to-end management in Camunda, there is a complete overview across all processes, including the involved RPA bots used to monitor individual operations, which is especially important for improving the overall performance of processes.\n \nThe new solution with Camunda BPM was introduced within Deutsche Telekom in 2019 and has been in production since the beginning of 2020.\n \n__About Camunda__\nCamunda is an open source software company innovating process automation with a developer-friendly approach that is standards-based, highly scalable and collaborative for business and IT.\n\nA community of thousands of users across companies such as Allianz, ING and T-Mobile design, automate and improve mission-critical business processes end-to-end with Camunda, enabling them to build software applications more flexibly, collaboratively and efficiently, gaining the business agility, visibility and scale needed to drive digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in San Francisco and Denver, USA. To learn more visit: [https://camunda.com/](https://camunda.com/)\n \nPress:\nGermany:\npresse@camunda.com\n \n \nUSA & International:\nJessica Jaffe, Sift Communications, Jessica.Jaffe@siftpr.com\nJill Reed, Sift Communications, Jill.Reed@siftpr.com\n","date":"2020-03-17","technicalName":"digital-transformation-deutsche-telekom-counts-on-camunda-for-process-automation-and-rpa-orchestration"},{"title":"Camunda Unveils Its Global Online Conference “CamundaCon Live”","text":"*More than 20 Sessions Over Two Days to Spotlight Leaders in Workflow and Process Automation*\n\n__WALTHAM, Mass. and BERLIN – March 24, 2020__ – [Camunda](https://camunda.com/), creators of developer-friendly, open source process automation software, opened registration for [CamundaCon Live](https://camundacon.com/live \"Camundacon Live\"), taking place April 23-24, 2020. CamundaCon Live features more than 20 speakers over two days who will share their best practices, insightful use cases, and technical deep dives for a global audience.\n\nSpeakers representing global organizations including Capital One, Fidelity Investments, Goldman Sachs, Keller Williams, Nokia Bell Labs, Societe Generale, and 24 Hour Fitness will share hands-on how they are deploying workflow and decision automation within their organization to achieve better customer experiences and business outcomes. Camunda CEO Jakob Freund will open the conference, sharing insight into the company’s work to innovate process automation with a highly flexible, infinitely scalable platform that runs on any cloud, public, private or hybrid. \n\n“CamundaCon Live will offer invaluable insight and lessons learned from some of the world’s foremost leaders in process automation,” said Gottfried Sehringer, Camunda CMO. “We’re fortunate to bring this slate of esteemed speakers and high-impact topics to a broad, global audience. It will also be highly interactive; attendees will have the opportunity to interact with each other as well as with speakers, product experts and process automation practitioners.” \n\nInitially planned as the company’s first U.S.-based CamundaCon conference, CamundaCon Live is being organized as the world heeds the advice of public health experts amid COVID-19 concerns. CamundaCon Live offers both technical and business case studies for process automation leaders, development teams and software architects.\n\nAttendees may register at no charge; registrants will also have access to an on-demand archive of sessions after the conference closes. See the agenda and sign up at [camundacon.com/live.](https://camundacon.com/live/)\n\n__About Camunda__\nCamunda is an open source software company innovating process automation with a developer-friendly approach that is standards-based, highly scalable and collaborative for business and IT.\n\nA community of thousands of users across companies such as Allianz, ING, and Vodafone design, automate and improve mission-critical business processes end-to-end with Camunda, enabling them to build software applications more flexibly, collaboratively and efficiently, gaining the business agility, visibility and scale needed to drive digital transformation. One of the fastest growing companies in EMEA as ranked by Deloitte, Camunda is based in Berlin with offices in Waltham, Mass., San Francisco, and Denver. To learn more visit [camunda.com](https://camunda.com \"Camunda\").\n\n__Press Contacts__\nJessica Jaffe\nSift Communications\ncamunda@siftpr.com\n\n","date":"2020-03-24","technicalName":"camunda-unveils-its-global-online-conference-camundacon-live"},{"title":"Camunda Launches Optimize 3.0 for Process Events Monitoring Across Systems","text":"*First BPMN-based process analytics platform to provide a unified view of real-time process insights from any data source*\n\n__BERLIN, April 7, 2020__ -- Camunda, creators of developer-friendly, open source process automation software, today announced the release of [Camunda Optimize 3.0](https://camunda.com/products/optimize/). This new release adds [end-to-end Process Events Monitoring](https://blog.camunda.com/post/2020/04/announcing-camunda-optimize-3.0/) to Camunda’s leading process automation platform. Now for the first time teams can analyze and visualize processes in their entirety -- even when they span across multiple systems and technologies. As a result, organizations can get much better transparency into the performance of their business processes, solve data silo problems, spot errors and make process improvements faster.\n\nIt’s typical that business processes may be managed by multiple systems, and many may have both automated and manual hand-offs in between. This can make it challenging to view and analyze the performance of a particular process from beginning to end. As organizations automate workflows and decisions with Camunda, Optimize provides analytics and dashboards that offer insight into these business processes. The latest release of Optimize reflects external data as well as Camunda-reported data, providing transparency across processes to [support operational monitoring and continuous improvement](https://camunda.com/products/optimize/reports/).\n\nCamunda Optimize 3.0 delivers true end-to-end insights so that customers can better understand and improve their core business processes:\n\n__- A simple API for importing data from external sources__, allowing teams to combine external process data with processes managed in Camunda BPM\n__- Mapping for imported process data__ to connect raw event data from external sources to steps in a human-readable BPMN 2.0 process model.\n__- End-to-end process analysis__ that enables users to build reports, dashboards, and alerts with a true end-to-end view of processes – no matter which part of the process is automated with Camunda BPM or another system. \n\n“Camunda Optimize provides real-time visibility into our process automation cases, including third-party events from Robotic Process Automation (RPA)” said Eduardo Conceição, RPA Architect at Nokia. “This allows us the opportunity for a complete, end-to-end view of an entire business process in an easier way - no matter what technology. As a result, we could better identify bottlenecks, analyze process performance and ultimately improve our processes overall.”\n\n“With developer-friendly workflow automation playing a central role in any digital transformation effort, organizations are recognizing the importance of process visibility and continuous process improvement,” said Camunda CTO Daniel Meyer. “Optimize 3.0 delivers groundbreaking new capabilities so our customers can analyze and improve their entire end-to-end business processes, even when those processes extend beyond Camunda BPM.”\n\nCustomers can get started with Optimize 3.0 today, as Camunda Optimize comes packaged with Camunda BPM’s commercial Enterprise Edition.  A free trial of the Enterprise Edition including Optimize 3.0 is available at [https://camunda.com/download/enterprise/](https://camunda.com/download/enterprise/). \n\nCamunda’s open source Community Edition is available at [www.camunda.com/download](http://www.Camunda.com/download) \n\nTo learn more, register for the [Camunda Optimize 3.0 Release webinar](https://camunda.com/learn/webinars/camunda-optimize-30-release-webinar/), scheduled for Wednesday, April 8, at 11 a.m. EDT, or view the recording on-demand. Also read “[Announcing Optimize 3.0: Any Data Source, True End-to-End Process Visibility](https://blog.camunda.com/post/2020/04/announcing-camunda-optimize-3.0/)” on the Camunda blog.\n\n__Press Contacts__\n\n__International__\nJessica Jaffe, Jill Reed\nSift Communications\ncamunda@siftpr.com\n\n__Germany__\nFlorian Bongartz\npresse@camunda.com\n+49 176 20250099\n\n\n__About Camunda__\nCamunda is an open source software company innovating process automation with a developer-friendly approach that is standards-based, highly scalable and collaborative for business and IT.\n\nA community of thousands of users across companies such as Allianz, ING, and Vodafone design, automate and improve mission-critical business processes end-to-end with Camunda, enabling them to build software applications more flexibly, collaboratively and efficiently, gaining the business agility, visibility and scale needed to drive digital transformation. To learn more visit [camunda.com](https://www.camunda.com)\n","date":"2020-04-07","technicalName":"camunda-launches-optimize-3-0-for-process-events-monitoring-across-systems"}]}